zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_FSTAT_CWSABT_MASK            (0x40U)
#define MSF1_B_test_FSTAT_CWSABT_SHIFT           (6U)
/*! CWSABT - Command Write Sequence Abort Flag
 *  0b0..Command write sequence not aborted
 *  0b1..Command write sequence aborted
 */
#define MSF1_B_test_FSTAT_CWSABT(x)              (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FSTAT_CWSABT_SHIFT)) & MSF1_B_test_FSTAT_CWSABT_MASK)

#define MSF1_B_test_FSTAT_CCIF_MASK              (0x80U)
#define MSF1_B_test_FSTAT_CCIF_SHIFT             (7U)
/*! CCIF - Command Complete Interrupt Flag
 *  0b0..Flash command or initialization in progress
 *  0b1..Flash command or initialization has completed
 */
#define MSF1_B_test_FSTAT_CCIF(x)                (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FSTAT_CCIF_SHIFT)) & MSF1_B_test_FSTAT_CCIF_MASK)

#define MSF1_B_test_FSTAT_CMDPRT_MASK            (0x300U)
#define MSF1_B_test_FSTAT_CMDPRT_SHIFT           (8U)
/*! CMDPRT - Command Protection Level
 *  0b00..Secure, normal access
 *  0b01..Secure, privileged access
 *  0b10..Nonsecure, normal access
 *  0b11..Nonsecure, privileged access
 */
#define MSF1_B_test_FSTAT_CMDPRT(x)              (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FSTAT_CMDPRT_SHIFT)) & MSF1_B_test_FSTAT_CMDPRT_MASK)

#define MSF1_B_test_FSTAT_CMDP_MASK              (0x800U)
#define MSF1_B_test_FSTAT_CMDP_SHIFT             (11U)
/*! CMDP - Command Protection Status Flag
 *  0b0..Command protection level and domain ID are stale
 *  0b1..Command protection level (CMDPRT) and domain ID (CMDDID) are set
 */
#define MSF1_B_test_FSTAT_CMDP(x)                (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FSTAT_CMDP_SHIFT)) & MSF1_B_test_FSTAT_CMDP_MASK)

#define MSF1_B_test_FSTAT_CMDDID_MASK            (0xF000U)
#define MSF1_B_test_FSTAT_CMDDID_SHIFT           (12U)
/*! CMDDID - Command Domain ID */
#define MSF1_B_test_FSTAT_CMDDID(x)              (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FSTAT_CMDDID_SHIFT)) & MSF1_B_test_FSTAT_CMDDID_MASK)

#define MSF1_B_test_FSTAT_DFDIF_MASK             (0x10000U)
#define MSF1_B_test_FSTAT_DFDIF_SHIFT            (16U)
/*! DFDIF - Double Bit Fault Detect Interrupt Flag
 *  0b0..Double bit fault not detected during a valid flash read access from the FMC
 *  0b1..Double bit fault detected (or FCTRL[FDFD] is set) during a valid flash read access from the FMC
 */
#define MSF1_B_test_FSTAT_DFDIF(x)               (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FSTAT_DFDIF_SHIFT)) & MSF1_B_test_FSTAT_DFDIF_MASK)

#define MSF1_B_test_FSTAT_SALV_USED_MASK         (0x20000U)
#define MSF1_B_test_FSTAT_SALV_USED_SHIFT        (17U)
/*! SALV_USED - Salvage Used for Erase operation
 *  0b0..Salvage not used during the last operation
 *  0b1..Salvage used during the last erase operation
 */
#define MSF1_B_test_FSTAT_SALV_USED(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FSTAT_SALV_USED_SHIFT)) & MSF1_B_test_FSTAT_SALV_USED_MASK)

#define MSF1_B_test_FSTAT_PEWEN_MASK             (0x3000000U)
#define MSF1_B_test_FSTAT_PEWEN_SHIFT            (24U)
/*! PEWEN - Program-Erase Write Enable Control
 *  0b00..Writes are not enabled
 *  0b01..Writes are enabled for one flash or IFR phrase (phrase programming, sector erase)
 *  0b10..Writes are enabled for one flash or IFR page (page programming)
 *  0b11..Reserved
 */
#define MSF1_B_test_FSTAT_PEWEN(x)               (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FSTAT_PEWEN_SHIFT)) & MSF1_B_test_FSTAT_PEWEN_MASK)

#define MSF1_B_test_FSTAT_PERDY_MASK             (0x80000000U)
#define MSF1_B_test_FSTAT_PERDY_SHIFT            (31U)
/*! PERDY - Program/Erase Ready Control/Status Flag
 *  0b0..Program or sector erase command operation is not stalled
 *  0b1..Program or sector erase command operation is stalled
 */
#define MSF1_B_test_FSTAT_PERDY(x)               (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FSTAT_PERDY_SHIFT)) & MSF1_B_test_FSTAT_PERDY_MASK)
/*! @} */

/*! @name FCNFG - Flash Configuration Register */
/*! @{ */

#define MSF1_B_test_FCNFG_CCIE_MASK              (0x80U)
#define MSF1_B_test_FCNFG_CCIE_SHIFT             (7U)
/*! CCIE - Command Complete Interrupt Enable
 *  0b0..Command complete interrupt disabled
 *  0b1..Command complete interrupt enabled. An interrupt request is generated whenever the FSTAT[CCIF] flag is set.
 */
#define MSF1_B_test_FCNFG_CCIE(x)                (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCNFG_CCIE_SHIFT)) & MSF1_B_test_FCNFG_CCIE_MASK)

#define MSF1_B_test_FCNFG_ERSREQ_MASK            (0x100U)
#define MSF1_B_test_FCNFG_ERSREQ_SHIFT           (8U)
/*! ERSREQ - Mass Erase (Erase All) Request
 *  0b0..No request or request complete
 *  0b1..Request to run the Mass Erase operation
 */
#define MSF1_B_test_FCNFG_ERSREQ(x)              (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCNFG_ERSREQ_SHIFT)) & MSF1_B_test_FCNFG_ERSREQ_MASK)

#define MSF1_B_test_FCNFG_DFDIE_MASK             (0x10000U)
#define MSF1_B_test_FCNFG_DFDIE_SHIFT            (16U)
/*! DFDIE - Double Bit Fault Detect Interrupt Enable
 *  0b0..Double bit fault detect interrupt disabled
 *  0b1..Double bit fault detect interrupt enabled; an interrupt request is generated whenever the FSTAT[DFDIF] flag is set
 */
#define MSF1_B_test_FCNFG_DFDIE(x)               (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCNFG_DFDIE_SHIFT)) & MSF1_B_test_FCNFG_DFDIE_MASK)

#define MSF1_B_test_FCNFG_ERSIEN0_MASK           (0xF000000U)
#define MSF1_B_test_FCNFG_ERSIEN0_SHIFT          (24U)
/*! ERSIEN0 - Erase IFR Sector Enable - Block 0
 *  0b0000..Block 0 IFR Sector X is protected from erase by ERSSCR command
 *  0b0001..Block 0 IFR Sector X is not protected from erase by ERSSCR command
 */
#define MSF1_B_test_FCNFG_ERSIEN0(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCNFG_ERSIEN0_SHIFT)) & MSF1_B_test_FCNFG_ERSIEN0_MASK)

#define MSF1_B_test_FCNFG_ERSIEN1_MASK           (0xF0000000U)
#define MSF1_B_test_FCNFG_ERSIEN1_SHIFT          (28U)
/*! ERSIEN1 - Erase IFR Sector Enable - Block 1 (for dual block configs)
 *  0b0000..Block 1 IFR Sector X is protected from erase by ERSSCR command
 *  0b0001..Block 1 IFR Sector X is not protected from erase by ERSSCR command
 */
#define MSF1_B_test_FCNFG_ERSIEN1(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCNFG_ERSIEN1_SHIFT)) & MSF1_B_test_FCNFG_ERSIEN1_MASK)
/*! @} */

