zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
/*! @name FCTRL - Flash Control Register */
/*! @{ */

#define MSF1_B_test_FCTRL_RWSC_MASK              (0xFU)
#define MSF1_B_test_FCTRL_RWSC_SHIFT             (0U)
/*! RWSC - Read Wait-State Control
 *  0b0000..no additional wait-states are added (single cycle access)
 *  0b0001..1 additional wait-state is added
 *  0b0010..2 additional wait-states are added
 *  0b0011..3 additional wait-states are added
 *  0b0100..4 additional wait-states are added
 *  0b0101..5 additional wait-states are added
 *  0b0110..6 additional wait-states are added
 *  0b0111..7 additional wait-states are added
 *  0b1000..8 additional wait-states are added
 *  0b1001..9 additional wait-states are added
 *  0b1010..10 additional wait-states are added
 *  0b1011..11 additional wait-states are added
 *  0b1100..12 additional wait-states are added
 *  0b1101..13 additional wait-states are added
 *  0b1110..14 additional wait-states are added
 *  0b1111..15 additional wait-states are added
 */
#define MSF1_B_test_FCTRL_RWSC(x)                (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCTRL_RWSC_SHIFT)) & MSF1_B_test_FCTRL_RWSC_MASK)

#define MSF1_B_test_FCTRL_LSACTIVE_MASK          (0x100U)
#define MSF1_B_test_FCTRL_LSACTIVE_SHIFT         (8U)
/*! LSACTIVE - Low Speed Active Mode
 *  0b0..Full speed active mode requested
 *  0b1..Low speed active mode requested
 */
#define MSF1_B_test_FCTRL_LSACTIVE(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCTRL_LSACTIVE_SHIFT)) & MSF1_B_test_FCTRL_LSACTIVE_MASK)

#define MSF1_B_test_FCTRL_FDFD_MASK              (0x10000U)
#define MSF1_B_test_FCTRL_FDFD_SHIFT             (16U)
/*! FDFD - Force Double Bit Fault Detect
 *  0b0..FSTAT[DFDIF] sets only if a double bit fault is detected during a valid flash read access from the FMC
 *  0b1..FSTAT[DFDIF] sets during any valid flash read access from the FMC; an interrupt request is generated if the DFDIE bit is set
 */
#define MSF1_B_test_FCTRL_FDFD(x)                (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCTRL_FDFD_SHIFT)) & MSF1_B_test_FCTRL_FDFD_MASK)

#define MSF1_B_test_FCTRL_ABTREQ_MASK            (0x1000000U)
#define MSF1_B_test_FCTRL_ABTREQ_SHIFT           (24U)
/*! ABTREQ - Abort Request
 *  0b0..No request to abort a command write sequence
 *  0b1..Request to abort a command write sequence
 */
#define MSF1_B_test_FCTRL_ABTREQ(x)              (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCTRL_ABTREQ_SHIFT)) & MSF1_B_test_FCTRL_ABTREQ_MASK)
/*! @} */

/*! @name FTEST - Flash Test Register */
/*! @{ */

#define MSF1_B_test_FTEST_TMECTL_MASK            (0x1U)
#define MSF1_B_test_FTEST_TMECTL_SHIFT           (0U)
/*! TMECTL - Test Mode Entry Control
 *  0b0..FTEST register always reads 0 and writes to FTEST are ignored
 *  0b1..FTEST register is readable and can be written to enable writability of TME
 */
#define MSF1_B_test_FTEST_TMECTL(x)              (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FTEST_TMECTL_SHIFT)) & MSF1_B_test_FTEST_TMECTL_MASK)

#define MSF1_B_test_FTEST_TMEWR_MASK             (0x2U)
#define MSF1_B_test_FTEST_TMEWR_SHIFT            (1U)
/*! TMEWR - Test Mode Entry Writable
 *  0b0..TME bit is not writable
 *  0b1..TME bit is writable
 */
#define MSF1_B_test_FTEST_TMEWR(x)               (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FTEST_TMEWR_SHIFT)) & MSF1_B_test_FTEST_TMEWR_MASK)

#define MSF1_B_test_FTEST_TME_MASK               (0x4U)
#define MSF1_B_test_FTEST_TME_SHIFT              (2U)
/*! TME - Test Mode Entry
 *  0b0..Test mode entry not requested
 *  0b1..Test mode entry requested
 */
#define MSF1_B_test_FTEST_TME(x)                 (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FTEST_TME_SHIFT)) & MSF1_B_test_FTEST_TME_MASK)

#define MSF1_B_test_FTEST_TMODE_MASK             (0x8U)
#define MSF1_B_test_FTEST_TMODE_SHIFT            (3U)
/*! TMODE - Test Mode Status
 *  0b0..Test mode not active
 *  0b1..Test mode active
 */
#define MSF1_B_test_FTEST_TMODE(x)               (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FTEST_TMODE_SHIFT)) & MSF1_B_test_FTEST_TMODE_MASK)

#define MSF1_B_test_FTEST_TMELOCK_MASK           (0x10U)
#define MSF1_B_test_FTEST_TMELOCK_SHIFT          (4U)
/*! TMELOCK - Test Mode Entry Lock
 *  0b0..FTEST register not locked from accepting writes
 *  0b1..FTEST register locked from accepting writes
 */
#define MSF1_B_test_FTEST_TMELOCK(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FTEST_TMELOCK_SHIFT)) & MSF1_B_test_FTEST_TMELOCK_MASK)
/*! @} */

/*! @name FCCOB0 - Flash Command Control 0 Register */
/*! @{ */

#define MSF1_B_test_FCCOB0_CMDCODE_MASK          (0xFFU)
#define MSF1_B_test_FCCOB0_CMDCODE_SHIFT         (0U)
/*! CMDCODE - Command code */
#define MSF1_B_test_FCCOB0_CMDCODE(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCCOB0_CMDCODE_SHIFT)) & MSF1_B_test_FCCOB0_CMDCODE_MASK)
/*! @} */

/*! @name FCCOB1 - Flash Command Control 1 Register */
/*! @{ */

#define MSF1_B_test_FCCOB1_CMDOPT_MASK           (0xFFU)
#define MSF1_B_test_FCCOB1_CMDOPT_SHIFT          (0U)
/*! CMDOPT - Command options */
#define MSF1_B_test_FCCOB1_CMDOPT(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCCOB1_CMDOPT_SHIFT)) & MSF1_B_test_FCCOB1_CMDOPT_MASK)
/*! @} */

/*! @name FCCOB2 - Flash Command Control 2 Register */
/*! @{ */

#define MSF1_B_test_FCCOB2_CMDADDR_MASK          (0xFFFFFFFFU)
#define MSF1_B_test_FCCOB2_CMDADDR_SHIFT         (0U)
/*! CMDADDR - Command starting address */
#define MSF1_B_test_FCCOB2_CMDADDR(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCCOB2_CMDADDR_SHIFT)) & MSF1_B_test_FCCOB2_CMDADDR_MASK)
/*! @} */

/*! @name FCCOB3 - Flash Command Control 3 Register */
/*! @{ */

#define MSF1_B_test_FCCOB3_CMDADDRE_MASK         (0xFFFFFFFFU)
#define MSF1_B_test_FCCOB3_CMDADDRE_SHIFT        (0U)
/*! CMDADDRE - Command ending address */
#define MSF1_B_test_FCCOB3_CMDADDRE(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCCOB3_CMDADDRE_SHIFT)) & MSF1_B_test_FCCOB3_CMDADDRE_MASK)
/*! @} */

/*! @name FCCOB4 - Flash Command Control 4 Register */
/*! @{ */

