zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_FCCOB4_CMDDATA0_MASK         (0xFFFFFFFFU)
#define MSF1_B_test_FCCOB4_CMDDATA0_SHIFT        (0U)
/*! CMDDATA0 - Command data word 0 */
#define MSF1_B_test_FCCOB4_CMDDATA0(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCCOB4_CMDDATA0_SHIFT)) & MSF1_B_test_FCCOB4_CMDDATA0_MASK)
/*! @} */

/*! @name FCCOB5 - Flash Command Control 5 Register */
/*! @{ */

#define MSF1_B_test_FCCOB5_CMDDATA1_MASK         (0xFFFFFFFFU)
#define MSF1_B_test_FCCOB5_CMDDATA1_SHIFT        (0U)
/*! CMDDATA1 - Command data word 1 */
#define MSF1_B_test_FCCOB5_CMDDATA1(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCCOB5_CMDDATA1_SHIFT)) & MSF1_B_test_FCCOB5_CMDDATA1_MASK)
/*! @} */

/*! @name FCCOB6 - Flash Command Control 6 Register */
/*! @{ */

#define MSF1_B_test_FCCOB6_CMDDATA2_MASK         (0xFFFFFFFFU)
#define MSF1_B_test_FCCOB6_CMDDATA2_SHIFT        (0U)
/*! CMDDATA2 - Command data word 2 */
#define MSF1_B_test_FCCOB6_CMDDATA2(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCCOB6_CMDDATA2_SHIFT)) & MSF1_B_test_FCCOB6_CMDDATA2_MASK)
/*! @} */

/*! @name FCCOB7 - Flash Command Control 7 Register */
/*! @{ */

#define MSF1_B_test_FCCOB7_CMDDATA3_MASK         (0xFFFFFFFFU)
#define MSF1_B_test_FCCOB7_CMDDATA3_SHIFT        (0U)
/*! CMDDATA3 - Command data word 3 */
#define MSF1_B_test_FCCOB7_CMDDATA3(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FCCOB7_CMDDATA3_SHIFT)) & MSF1_B_test_FCCOB7_CMDDATA3_MASK)
/*! @} */

/*! @name RESET_STATUS - FMU Initialization Tracking Register */
/*! @{ */

#define MSF1_B_test_RESET_STATUS_ARY_TRIM_DONE_MASK (0x1U)
#define MSF1_B_test_RESET_STATUS_ARY_TRIM_DONE_SHIFT (0U)
/*! ARY_TRIM_DONE - Array Trim Complete
 *  0b0..Recall register load operation has not been completed
 *  0b1..Recall register load operation has completed
 */
#define MSF1_B_test_RESET_STATUS_ARY_TRIM_DONE(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_ARY_TRIM_DONE_SHIFT)) & MSF1_B_test_RESET_STATUS_ARY_TRIM_DONE_MASK)

#define MSF1_B_test_RESET_STATUS_FMU_PARM_EN_MASK (0x2U)
#define MSF1_B_test_RESET_STATUS_FMU_PARM_EN_SHIFT (1U)
/*! FMU_PARM_EN - Status of the C0DE_C0DEh check to enable loading of the FMU parameters
 *  0b0..C0DE_C0DEh check not attempted
 *  0b1..C0DE_C0DEh check completed
 */
#define MSF1_B_test_RESET_STATUS_FMU_PARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_FMU_PARM_EN_SHIFT)) & MSF1_B_test_RESET_STATUS_FMU_PARM_EN_MASK)

#define MSF1_B_test_RESET_STATUS_FMU_PARM_DONE_MASK (0x4U)
#define MSF1_B_test_RESET_STATUS_FMU_PARM_DONE_SHIFT (2U)
/*! FMU_PARM_DONE - FMU Register Load Complete
 *  0b0..FMU registers have not been loaded
 *  0b1..FMU registers have been loaded
 */
#define MSF1_B_test_RESET_STATUS_FMU_PARM_DONE(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_FMU_PARM_DONE_SHIFT)) & MSF1_B_test_RESET_STATUS_FMU_PARM_DONE_MASK)

#define MSF1_B_test_RESET_STATUS_SOC_TRIM_EN_MASK (0x8U)
#define MSF1_B_test_RESET_STATUS_SOC_TRIM_EN_SHIFT (3U)
/*! SOC_TRIM_EN - Status of the C0DE_C0DEh check to enable loading of the SoC trim settings
 *  0b0..C0DE_C0DEh check not attempted
 *  0b1..C0DE_C0DEh check completed
 */
#define MSF1_B_test_RESET_STATUS_SOC_TRIM_EN(x)  (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_SOC_TRIM_EN_SHIFT)) & MSF1_B_test_RESET_STATUS_SOC_TRIM_EN_MASK)

#define MSF1_B_test_RESET_STATUS_SOC_TRIM_ECC_MASK (0x10U)
#define MSF1_B_test_RESET_STATUS_SOC_TRIM_ECC_SHIFT (4U)
/*! SOC_TRIM_ECC - Status of the C0DE_C0DEh check for enabling ECC decoder during reads of SoC trim settings
 *  0b0..C0DE_C0DEh check failed
 *  0b1..C0DE_C0DEh check passed
 */
#define MSF1_B_test_RESET_STATUS_SOC_TRIM_ECC(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_SOC_TRIM_ECC_SHIFT)) & MSF1_B_test_RESET_STATUS_SOC_TRIM_ECC_MASK)

#define MSF1_B_test_RESET_STATUS_SOC_TRIM_DONE_MASK (0x20U)
#define MSF1_B_test_RESET_STATUS_SOC_TRIM_DONE_SHIFT (5U)
/*! SOC_TRIM_DONE - SoC Trim Complete
 *  0b0..SoC Trim registers have not been updated
 *  0b1..All SoC Trim registers have been updated
 */
#define MSF1_B_test_RESET_STATUS_SOC_TRIM_DONE(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_SOC_TRIM_DONE_SHIFT)) & MSF1_B_test_RESET_STATUS_SOC_TRIM_DONE_MASK)

#define MSF1_B_test_RESET_STATUS_RPR_DONE_MASK   (0x40U)
#define MSF1_B_test_RESET_STATUS_RPR_DONE_SHIFT  (6U)
/*! RPR_DONE - Array Repair Complete
 *  0b0..Repair registers have not been loaded
 *  0b1..Repair registers have been loaded
 */
#define MSF1_B_test_RESET_STATUS_RPR_DONE(x)     (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_RPR_DONE_SHIFT)) & MSF1_B_test_RESET_STATUS_RPR_DONE_MASK)

#define MSF1_B_test_RESET_STATUS_INIT_DONE_MASK  (0x80U)
#define MSF1_B_test_RESET_STATUS_INIT_DONE_SHIFT (7U)
/*! INIT_DONE - Initialization Done
 *  0b0..All initialization steps did not complete
 *  0b1..All initialization steps completed
 */
#define MSF1_B_test_RESET_STATUS_INIT_DONE(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_INIT_DONE_SHIFT)) & MSF1_B_test_RESET_STATUS_INIT_DONE_MASK)

#define MSF1_B_test_RESET_STATUS_RST_SF_ERR_MASK (0x100U)
#define MSF1_B_test_RESET_STATUS_RST_SF_ERR_SHIFT (8U)
/*! RST_SF_ERR - ECC Single Fault during Reset Recovery
 *  0b0..No single-bit faults detected during initialization
 *  0b1..At least one single ECC fault was detected during initialization
 */
#define MSF1_B_test_RESET_STATUS_RST_SF_ERR(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_RST_SF_ERR_SHIFT)) & MSF1_B_test_RESET_STATUS_RST_SF_ERR_MASK)

#define MSF1_B_test_RESET_STATUS_RST_DF_ERR_MASK (0x200U)
#define MSF1_B_test_RESET_STATUS_RST_DF_ERR_SHIFT (9U)
/*! RST_DF_ERR - ECC Double Fault during Reset Recovery
 *  0b0..No double-bit faults detected during initialization
 *  0b1..Double-bit ECC fault was detected during initialization
 */
#define MSF1_B_test_RESET_STATUS_RST_DF_ERR(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_RST_DF_ERR_SHIFT)) & MSF1_B_test_RESET_STATUS_RST_DF_ERR_MASK)

