zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_RESET_STATUS_SOC_TRIM_DF_ERR_MASK (0x3FC00U)
#define MSF1_B_test_RESET_STATUS_SOC_TRIM_DF_ERR_SHIFT (10U)
/*! SOC_TRIM_DF_ERR - ECC Double Fault during load of SoC Trim phrases */
#define MSF1_B_test_RESET_STATUS_SOC_TRIM_DF_ERR(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_SOC_TRIM_DF_ERR_SHIFT)) & MSF1_B_test_RESET_STATUS_SOC_TRIM_DF_ERR_MASK)

#define MSF1_B_test_RESET_STATUS_RST_PATCH_LD_MASK (0x40000U)
#define MSF1_B_test_RESET_STATUS_RST_PATCH_LD_SHIFT (18U)
/*! RST_PATCH_LD - Reset Patch Required
 *  0b0..No patch required to be loaded during reset
 *  0b1..Patch loaded during reset
 */
#define MSF1_B_test_RESET_STATUS_RST_PATCH_LD(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_RST_PATCH_LD_SHIFT)) & MSF1_B_test_RESET_STATUS_RST_PATCH_LD_MASK)

#define MSF1_B_test_RESET_STATUS_RECALL_DATA_MISMATCH_MASK (0x80000U)
#define MSF1_B_test_RESET_STATUS_RECALL_DATA_MISMATCH_SHIFT (19U)
/*! RECALL_DATA_MISMATCH - Recall Data Mismatch
 *  0b0..Data read towards end of reset matched data read for Recall
 *  0b1..Data read towards end of reset did not match data read for recall
 */
#define MSF1_B_test_RESET_STATUS_RECALL_DATA_MISMATCH(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RESET_STATUS_RECALL_DATA_MISMATCH_SHIFT)) & MSF1_B_test_RESET_STATUS_RECALL_DATA_MISMATCH_MASK)
/*! @} */

/*! @name MCTL - FMU Control Register */
/*! @{ */

#define MSF1_B_test_MCTL_COREHLD_MASK            (0x1U)
#define MSF1_B_test_MCTL_COREHLD_SHIFT           (0U)
/*! COREHLD - Core Hold
 *  0b0..CPU access is allowed
 *  0b1..CPU access must be blocked
 */
#define MSF1_B_test_MCTL_COREHLD(x)              (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_COREHLD_SHIFT)) & MSF1_B_test_MCTL_COREHLD_MASK)

#define MSF1_B_test_MCTL_LSACT_EN_MASK           (0x4U)
#define MSF1_B_test_MCTL_LSACT_EN_SHIFT          (2U)
/*! LSACT_EN - LSACTIVE Feature Enable
 *  0b0..LSACTIVE feature disabled completely: FCTRL[LSACTIVE] is forced low and no longer writable, LVE cannot assert at the TSMC array interface.
 *  0b1..LSACTIVE feature fully enabled and controllable by SoC and internal UINT SM.
 */
#define MSF1_B_test_MCTL_LSACT_EN(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_LSACT_EN_SHIFT)) & MSF1_B_test_MCTL_LSACT_EN_MASK)

#define MSF1_B_test_MCTL_LSACTWREN_MASK          (0x8U)
#define MSF1_B_test_MCTL_LSACTWREN_SHIFT         (3U)
/*! LSACTWREN - LSACTIVE Write Enable
 *  0b0..Unrestricted write access allowed
 *  0b1..Write access while CMP set must match CMDDID and CMDPRT
 */
#define MSF1_B_test_MCTL_LSACTWREN(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_LSACTWREN_SHIFT)) & MSF1_B_test_MCTL_LSACTWREN_MASK)

#define MSF1_B_test_MCTL_MASTER_REPAIR_EN_MASK   (0x10U)
#define MSF1_B_test_MCTL_MASTER_REPAIR_EN_SHIFT  (4U)
/*! MASTER_REPAIR_EN - Master Repair Enable
 *  0b0..Repair disabled
 *  0b1..Repair enable determined by bit 0 of each REPAIR register
 */
#define MSF1_B_test_MCTL_MASTER_REPAIR_EN(x)     (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_MASTER_REPAIR_EN_SHIFT)) & MSF1_B_test_MCTL_MASTER_REPAIR_EN_MASK)

#define MSF1_B_test_MCTL_RFCMDEN_MASK            (0x20U)
#define MSF1_B_test_MCTL_RFCMDEN_SHIFT           (5U)
/*! RFCMDEN - RF Active Command Enable Control
 *  0b0..Flash commands blocked (CCIF not writable)
 *  0b1..Flash commands allowed
 */
#define MSF1_B_test_MCTL_RFCMDEN(x)              (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_RFCMDEN_SHIFT)) & MSF1_B_test_MCTL_RFCMDEN_MASK)

#define MSF1_B_test_MCTL_CWSABTEN_MASK           (0x40U)
#define MSF1_B_test_MCTL_CWSABTEN_SHIFT          (6U)
/*! CWSABTEN - Command Write Sequence Abort Enable
 *  0b0..CWS abort feature is disabled
 *  0b1..CWS abort feature is enabled
 */
#define MSF1_B_test_MCTL_CWSABTEN(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_CWSABTEN_SHIFT)) & MSF1_B_test_MCTL_CWSABTEN_MASK)

#define MSF1_B_test_MCTL_MRGRDDIS_MASK           (0x80U)
#define MSF1_B_test_MCTL_MRGRDDIS_SHIFT          (7U)
/*! MRGRDDIS - Margin Read Disable
 *  0b0..Margin Read Settings are enabled
 *  0b1..Margin Read Settings are disabled
 */
#define MSF1_B_test_MCTL_MRGRDDIS(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_MRGRDDIS_SHIFT)) & MSF1_B_test_MCTL_MRGRDDIS_MASK)

#define MSF1_B_test_MCTL_MRGRD0_MASK             (0xF00U)
#define MSF1_B_test_MCTL_MRGRD0_SHIFT            (8U)
/*! MRGRD0 - Margin Read Setting for Program */
#define MSF1_B_test_MCTL_MRGRD0(x)               (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_MRGRD0_SHIFT)) & MSF1_B_test_MCTL_MRGRD0_MASK)

#define MSF1_B_test_MCTL_MRGRD1_MASK             (0xF000U)
#define MSF1_B_test_MCTL_MRGRD1_SHIFT            (12U)
/*! MRGRD1 - Margin Read Setting for Erase */
#define MSF1_B_test_MCTL_MRGRD1(x)               (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_MRGRD1_SHIFT)) & MSF1_B_test_MCTL_MRGRD1_MASK)

#define MSF1_B_test_MCTL_ERSAACK_MASK            (0x10000U)
#define MSF1_B_test_MCTL_ERSAACK_SHIFT           (16U)
/*! ERSAACK - Mass Erase (Erase All) Acknowledge
 *  0b0..Mass Erase operation is not active (operation has completed or has not started)
 *  0b1..Mass Erase operation is active (controller acknowledges that the soc_ersall_req input is asserted and will continue with the operation)
 */
#define MSF1_B_test_MCTL_ERSAACK(x)              (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_ERSAACK_SHIFT)) & MSF1_B_test_MCTL_ERSAACK_MASK)

#define MSF1_B_test_MCTL_SCAN_OBS_MASK           (0x80000U)
#define MSF1_B_test_MCTL_SCAN_OBS_SHIFT          (19U)
/*! SCAN_OBS - Scan Observability Control
 *  0b0..Normal functional behavior
 *  0b1..Enables observation of signals that may otherwise be ATPG untestable
 */
#define MSF1_B_test_MCTL_SCAN_OBS(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_SCAN_OBS_SHIFT)) & MSF1_B_test_MCTL_SCAN_OBS_MASK)

#define MSF1_B_test_MCTL_BIST_CTL_MASK           (0x100000U)
#define MSF1_B_test_MCTL_BIST_CTL_SHIFT          (20U)
/*! BIST_CTL - BIST IP Control
 *  0b0..BIST IP disabled
 *  0b1..BIST IP enabled
 */
#define MSF1_B_test_MCTL_BIST_CTL(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_BIST_CTL_SHIFT)) & MSF1_B_test_MCTL_BIST_CTL_MASK)

#define MSF1_B_test_MCTL_SMWR_CTL_MASK           (0x200000U)
#define MSF1_B_test_MCTL_SMWR_CTL_SHIFT          (21U)
/*! SMWR_CTL - SMWR IP Control
 *  0b0..SMWR IP disabled
 *  0b1..SMWR IP enabled
 */
#define MSF1_B_test_MCTL_SMWR_CTL(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_SMWR_CTL_SHIFT)) & MSF1_B_test_MCTL_SMWR_CTL_MASK)

#define MSF1_B_test_MCTL_SALV_DIS_MASK           (0x1000000U)
#define MSF1_B_test_MCTL_SALV_DIS_SHIFT          (24U)
/*! SALV_DIS - Salvage Disable
 *  0b0..Salvage enabled (ECC used during erase verify)
 *  0b1..Salvage disabled (ECC not used during erase verify)
 */
#define MSF1_B_test_MCTL_SALV_DIS(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_SALV_DIS_SHIFT)) & MSF1_B_test_MCTL_SALV_DIS_MASK)

#define MSF1_B_test_MCTL_SOC_ECC_CTL_MASK        (0x2000000U)
#define MSF1_B_test_MCTL_SOC_ECC_CTL_SHIFT       (25U)
/*! SOC_ECC_CTL - SOC ECC Control
 *  0b0..ECC is enabled for SOC read access
 *  0b1..ECC is disabled for SOC read access
 */
#define MSF1_B_test_MCTL_SOC_ECC_CTL(x)          (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_SOC_ECC_CTL_SHIFT)) & MSF1_B_test_MCTL_SOC_ECC_CTL_MASK)

