zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_MCTL_FMU_ECC_CTL_MASK        (0x4000000U)
#define MSF1_B_test_MCTL_FMU_ECC_CTL_SHIFT       (26U)
/*! FMU_ECC_CTL - FMU ECC Control
 *  0b0..ECC is enabled for FMU program operations
 *  0b1..ECC is disabled for FMU program operations
 */
#define MSF1_B_test_MCTL_FMU_ECC_CTL(x)          (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_FMU_ECC_CTL_SHIFT)) & MSF1_B_test_MCTL_FMU_ECC_CTL_MASK)

#define MSF1_B_test_MCTL_BIST_PWR_DIS_MASK       (0x20000000U)
#define MSF1_B_test_MCTL_BIST_PWR_DIS_SHIFT      (29U)
/*! BIST_PWR_DIS - BIST Power Mode Disable
 *  0b0..BIST DFT logic has full control of SLM and LVE when BIST is enabled (including during commands)
 *  0b1..BIST DFT logic has no control of SLM and LVE; power mode RTL is in complete control of SLM and LVE values
 */
#define MSF1_B_test_MCTL_BIST_PWR_DIS(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_BIST_PWR_DIS_SHIFT)) & MSF1_B_test_MCTL_BIST_PWR_DIS_MASK)

#define MSF1_B_test_MCTL_OSC_H_MASK              (0x80000000U)
#define MSF1_B_test_MCTL_OSC_H_SHIFT             (31U)
/*! OSC_H - Oscillator control
 *  0b0..Use APB clock
 *  0b1..Use a known fixed-frequency clock, e.g. 12 MHz
 */
#define MSF1_B_test_MCTL_OSC_H(x)                (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MCTL_OSC_H_SHIFT)) & MSF1_B_test_MCTL_OSC_H_MASK)
/*! @} */

/*! @name BSEL_GEN - FMU Block Select Generation Register */
/*! @{ */

#define MSF1_B_test_BSEL_GEN_SBSEL_GEN_MASK      (0x3U)
#define MSF1_B_test_BSEL_GEN_SBSEL_GEN_SHIFT     (0U)
/*! SBSEL_GEN - Generated SBSEL */
#define MSF1_B_test_BSEL_GEN_SBSEL_GEN(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_BSEL_GEN_SBSEL_GEN_SHIFT)) & MSF1_B_test_BSEL_GEN_SBSEL_GEN_MASK)

#define MSF1_B_test_BSEL_GEN_MBSEL_GEN_MASK      (0x300U)
#define MSF1_B_test_BSEL_GEN_MBSEL_GEN_SHIFT     (8U)
/*! MBSEL_GEN - Generated MBSEL */
#define MSF1_B_test_BSEL_GEN_MBSEL_GEN(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_BSEL_GEN_MBSEL_GEN_SHIFT)) & MSF1_B_test_BSEL_GEN_MBSEL_GEN_MASK)
/*! @} */

/*! @name PWR_OPT - Power Mode Options Register */
/*! @{ */

#define MSF1_B_test_PWR_OPT_PD_CDIV_MASK         (0xFFU)
#define MSF1_B_test_PWR_OPT_PD_CDIV_SHIFT        (0U)
/*! PD_CDIV - Power Down Clock Divider Setting */
#define MSF1_B_test_PWR_OPT_PD_CDIV(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_PWR_OPT_PD_CDIV_SHIFT)) & MSF1_B_test_PWR_OPT_PD_CDIV_MASK)

#define MSF1_B_test_PWR_OPT_SLM_COUNT_MASK       (0x3FF0000U)
#define MSF1_B_test_PWR_OPT_SLM_COUNT_SHIFT      (16U)
/*! SLM_COUNT - Sleep Recovery Timer Count */
#define MSF1_B_test_PWR_OPT_SLM_COUNT(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_PWR_OPT_SLM_COUNT_SHIFT)) & MSF1_B_test_PWR_OPT_SLM_COUNT_MASK)

#define MSF1_B_test_PWR_OPT_PD_TIMER_EN_MASK     (0x80000000U)
#define MSF1_B_test_PWR_OPT_PD_TIMER_EN_SHIFT    (31U)
/*! PD_TIMER_EN - Power Down BIST Timer Enable
 *  0b0..BIST timer is not triggered during Power Down recovery
 *  0b1..BIST timer is triggered during Power Down recovery (default behavior)
 */
#define MSF1_B_test_PWR_OPT_PD_TIMER_EN(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_PWR_OPT_PD_TIMER_EN_SHIFT)) & MSF1_B_test_PWR_OPT_PD_TIMER_EN_MASK)
/*! @} */

/*! @name CMD_CHECK - FMU Command Check Register */
/*! @{ */

#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_PHR_MASK (0x1U)
#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_PHR_SHIFT (0U)
/*! ALIGNFAIL_PHR - Phrase Alignment Fail
 *  0b0..The address is phrase-aligned
 *  0b1..The address is not phrase-aligned
 */
#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_PHR(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_CMD_CHECK_ALIGNFAIL_PHR_SHIFT)) & MSF1_B_test_CMD_CHECK_ALIGNFAIL_PHR_MASK)

#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_PG_MASK  (0x2U)
#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_PG_SHIFT (1U)
/*! ALIGNFAIL_PG - Page Alignment Fail
 *  0b0..The address is page-aligned
 *  0b1..The address is not page-aligned
 */
#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_PG(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_CMD_CHECK_ALIGNFAIL_PG_SHIFT)) & MSF1_B_test_CMD_CHECK_ALIGNFAIL_PG_MASK)

#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_SCR_MASK (0x4U)
#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_SCR_SHIFT (2U)
/*! ALIGNFAIL_SCR - Sector Alignment Fail
 *  0b0..The address is sector-aligned
 *  0b1..The address is not sector-aligned
 */
#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_SCR(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_CMD_CHECK_ALIGNFAIL_SCR_SHIFT)) & MSF1_B_test_CMD_CHECK_ALIGNFAIL_SCR_MASK)

#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_BLK_MASK (0x8U)
#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_BLK_SHIFT (3U)
/*! ALIGNFAIL_BLK - Block Alignment Fail
 *  0b0..The address is block-aligned
 *  0b1..The address is not block-aligned
 */
#define MSF1_B_test_CMD_CHECK_ALIGNFAIL_BLK(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_CMD_CHECK_ALIGNFAIL_BLK_SHIFT)) & MSF1_B_test_CMD_CHECK_ALIGNFAIL_BLK_MASK)

#define MSF1_B_test_CMD_CHECK_ADDR_FAIL_MASK     (0x10U)
#define MSF1_B_test_CMD_CHECK_ADDR_FAIL_SHIFT    (4U)
/*! ADDR_FAIL - Address Fail
 *  0b0..The address is within the flash or IFR address space
 *  0b1..The address is outside the flash or IFR address space
 */
#define MSF1_B_test_CMD_CHECK_ADDR_FAIL(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_CMD_CHECK_ADDR_FAIL_SHIFT)) & MSF1_B_test_CMD_CHECK_ADDR_FAIL_MASK)

#define MSF1_B_test_CMD_CHECK_IFR_CMD_MASK       (0x20U)
#define MSF1_B_test_CMD_CHECK_IFR_CMD_SHIFT      (5U)
/*! IFR_CMD - IFR Command
 *  0b0..The command operates on a main flash address
 *  0b1..The command operates on an IFR address
 */
#define MSF1_B_test_CMD_CHECK_IFR_CMD(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_CMD_CHECK_IFR_CMD_SHIFT)) & MSF1_B_test_CMD_CHECK_IFR_CMD_MASK)

#define MSF1_B_test_CMD_CHECK_ALL_CMD_MASK       (0x40U)
#define MSF1_B_test_CMD_CHECK_ALL_CMD_SHIFT      (6U)
/*! ALL_CMD - All Blocks Command
 *  0b0..The command operates on a single flash block
 *  0b1..The command operates on all flash blocks
 */
#define MSF1_B_test_CMD_CHECK_ALL_CMD(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_CMD_CHECK_ALL_CMD_SHIFT)) & MSF1_B_test_CMD_CHECK_ALL_CMD_MASK)

#define MSF1_B_test_CMD_CHECK_RANGE_FAIL_MASK    (0x80U)
#define MSF1_B_test_CMD_CHECK_RANGE_FAIL_SHIFT   (7U)
/*! RANGE_FAIL - Address Range Fail
 *  0b0..The address range is valid
 *  0b1..The address range is invalid
 */
#define MSF1_B_test_CMD_CHECK_RANGE_FAIL(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_CMD_CHECK_RANGE_FAIL_SHIFT)) & MSF1_B_test_CMD_CHECK_RANGE_FAIL_MASK)

#define MSF1_B_test_CMD_CHECK_SCR_ALIGN_CHK_MASK (0x100U)
#define MSF1_B_test_CMD_CHECK_SCR_ALIGN_CHK_SHIFT (8U)
/*! SCR_ALIGN_CHK - Sector Alignment Check
 *  0b0..No sector alignment check
 *  0b1..Sector alignment check
 */
#define MSF1_B_test_CMD_CHECK_SCR_ALIGN_CHK(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_CMD_CHECK_SCR_ALIGN_CHK_SHIFT)) & MSF1_B_test_CMD_CHECK_SCR_ALIGN_CHK_MASK)

#define MSF1_B_test_CMD_CHECK_OPTION_FAIL_MASK   (0x200U)
#define MSF1_B_test_CMD_CHECK_OPTION_FAIL_SHIFT  (9U)
/*! OPTION_FAIL - Option Check Fail
 *  0b0..Option check passes for read command or command is not a read command
 *  0b1..Option check fails for read command
 */
#define MSF1_B_test_CMD_CHECK_OPTION_FAIL(x)     (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_CMD_CHECK_OPTION_FAIL_SHIFT)) & MSF1_B_test_CMD_CHECK_OPTION_FAIL_MASK)

#define MSF1_B_test_CMD_CHECK_ILLEGAL_CMD_MASK   (0x400U)
#define MSF1_B_test_CMD_CHECK_ILLEGAL_CMD_SHIFT  (10U)
/*! ILLEGAL_CMD - Illegal Command
 *  0b0..Command is legal
 *  0b1..Command is illegal
 */
#define MSF1_B_test_CMD_CHECK_ILLEGAL_CMD(x)     (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_CMD_CHECK_ILLEGAL_CMD_SHIFT)) & MSF1_B_test_CMD_CHECK_ILLEGAL_CMD_MASK)
/*! @} */

/*! @name BSEL - FMU Block Select Register */
/*! @{ */

