zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_BSEL_SBSEL_MASK              (0x3U)
#define MSF1_B_test_BSEL_SBSEL_SHIFT             (0U)
/*! SBSEL - Slave Block Select */
#define MSF1_B_test_BSEL_SBSEL(x)                (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_BSEL_SBSEL_SHIFT)) & MSF1_B_test_BSEL_SBSEL_MASK)

#define MSF1_B_test_BSEL_MBSEL_MASK              (0x300U)
#define MSF1_B_test_BSEL_MBSEL_SHIFT             (8U)
/*! MBSEL - Master Block Select */
#define MSF1_B_test_BSEL_MBSEL(x)                (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_BSEL_MBSEL_SHIFT)) & MSF1_B_test_BSEL_MBSEL_MASK)
/*! @} */

/*! @name MSIZE - FMU Memory Size Register */
/*! @{ */

#define MSF1_B_test_MSIZE_MAXADDR0_MASK          (0xFFU)
#define MSF1_B_test_MSIZE_MAXADDR0_SHIFT         (0U)
/*! MAXADDR0 - Size of Flash Block 0 */
#define MSF1_B_test_MSIZE_MAXADDR0(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MSIZE_MAXADDR0_SHIFT)) & MSF1_B_test_MSIZE_MAXADDR0_MASK)
/*! @} */

/*! @name FLASH_RD_ADD - Flash Read Address Register */
/*! @{ */

#define MSF1_B_test_FLASH_RD_ADD_FLASH_RD_ADD_MASK (0xFFFFFFFFU)
#define MSF1_B_test_FLASH_RD_ADD_FLASH_RD_ADD_SHIFT (0U)
/*! FLASH_RD_ADD - Flash Read Address */
#define MSF1_B_test_FLASH_RD_ADD_FLASH_RD_ADD(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FLASH_RD_ADD_FLASH_RD_ADD_SHIFT)) & MSF1_B_test_FLASH_RD_ADD_FLASH_RD_ADD_MASK)
/*! @} */

/*! @name FLASH_STOP_ADD - Flash Stop Address Register */
/*! @{ */

#define MSF1_B_test_FLASH_STOP_ADD_FLASH_STOP_ADD_MASK (0xFFFFFFFFU)
#define MSF1_B_test_FLASH_STOP_ADD_FLASH_STOP_ADD_SHIFT (0U)
/*! FLASH_STOP_ADD - Flash Stop Address */
#define MSF1_B_test_FLASH_STOP_ADD_FLASH_STOP_ADD(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FLASH_STOP_ADD_FLASH_STOP_ADD_SHIFT)) & MSF1_B_test_FLASH_STOP_ADD_FLASH_STOP_ADD_MASK)
/*! @} */

/*! @name FLASH_RD_CTRL - Flash Read Control Register */
/*! @{ */

#define MSF1_B_test_FLASH_RD_CTRL_FLASH_RD_MASK  (0x1U)
#define MSF1_B_test_FLASH_RD_CTRL_FLASH_RD_SHIFT (0U)
/*! FLASH_RD - Flash Read Enable
 *  0b0..Manual flash read not enabled.(default)
 *  0b1..Manual flash read enabled
 */
#define MSF1_B_test_FLASH_RD_CTRL_FLASH_RD(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FLASH_RD_CTRL_FLASH_RD_SHIFT)) & MSF1_B_test_FLASH_RD_CTRL_FLASH_RD_MASK)

#define MSF1_B_test_FLASH_RD_CTRL_WIDE_LOAD_MASK (0x2U)
#define MSF1_B_test_FLASH_RD_CTRL_WIDE_LOAD_SHIFT (1U)
/*! WIDE_LOAD - Wide Load Enable
 *  0b0..Wide load mode disabled (default)
 *  0b1..Wide load mode enabled
 */
#define MSF1_B_test_FLASH_RD_CTRL_WIDE_LOAD(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FLASH_RD_CTRL_WIDE_LOAD_SHIFT)) & MSF1_B_test_FLASH_RD_CTRL_WIDE_LOAD_MASK)

#define MSF1_B_test_FLASH_RD_CTRL_SINGLE_RD_MASK (0x4U)
#define MSF1_B_test_FLASH_RD_CTRL_SINGLE_RD_SHIFT (2U)
/*! SINGLE_RD - Single Flash Read
 *  0b0..Normal UINT operation
 *  0b1..UINT configured for single cycle reads
 */
#define MSF1_B_test_FLASH_RD_CTRL_SINGLE_RD(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FLASH_RD_CTRL_SINGLE_RD_SHIFT)) & MSF1_B_test_FLASH_RD_CTRL_SINGLE_RD_MASK)
/*! @} */

/*! @name MM_ADDR - Memory Map Address Register */
/*! @{ */

#define MSF1_B_test_MM_ADDR_MM_ADDR_MASK         (0xFFFFFFFFU)
#define MSF1_B_test_MM_ADDR_MM_ADDR_SHIFT        (0U)
/*! MM_ADDR - Memory Map Address */
#define MSF1_B_test_MM_ADDR_MM_ADDR(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MM_ADDR_MM_ADDR_SHIFT)) & MSF1_B_test_MM_ADDR_MM_ADDR_MASK)
/*! @} */

/*! @name MM_WDATA - Memory Map Write Data Register */
/*! @{ */

#define MSF1_B_test_MM_WDATA_MM_WDATA_MASK       (0xFFFFFFFFU)
#define MSF1_B_test_MM_WDATA_MM_WDATA_SHIFT      (0U)
/*! MM_WDATA - Memory Map Write Data */
#define MSF1_B_test_MM_WDATA_MM_WDATA(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MM_WDATA_MM_WDATA_SHIFT)) & MSF1_B_test_MM_WDATA_MM_WDATA_MASK)
/*! @} */

/*! @name MM_CTL - Memory Map Control Register */
/*! @{ */

#define MSF1_B_test_MM_CTL_MM_SEL_MASK           (0x1U)
#define MSF1_B_test_MM_CTL_MM_SEL_SHIFT          (0U)
/*! MM_SEL - Register Access Enable */
#define MSF1_B_test_MM_CTL_MM_SEL(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MM_CTL_MM_SEL_SHIFT)) & MSF1_B_test_MM_CTL_MM_SEL_MASK)

#define MSF1_B_test_MM_CTL_MM_RD_MASK            (0x2U)
#define MSF1_B_test_MM_CTL_MM_RD_SHIFT           (1U)
/*! MM_RD - Register R/W Control
 *  0b0..Write to register
 *  0b1..Read register
 */
#define MSF1_B_test_MM_CTL_MM_RD(x)              (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MM_CTL_MM_RD_SHIFT)) & MSF1_B_test_MM_CTL_MM_RD_MASK)

#define MSF1_B_test_MM_CTL_BIST_ON_MASK          (0x4U)
#define MSF1_B_test_MM_CTL_BIST_ON_SHIFT         (2U)
/*! BIST_ON - BIST on
 *  0b0..BIST enable not forced by user interface
 *  0b1..BIST enable control by user interface
 */
#define MSF1_B_test_MM_CTL_BIST_ON(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MM_CTL_BIST_ON_SHIFT)) & MSF1_B_test_MM_CTL_BIST_ON_MASK)

#define MSF1_B_test_MM_CTL_FORCE_SW_CLK_MASK     (0x8U)
#define MSF1_B_test_MM_CTL_FORCE_SW_CLK_SHIFT    (3U)
/*! FORCE_SW_CLK - Force Switch Clock
 *  0b0..Switch clock not forced on (gated normally)
 *  0b1..Switch clock forced on
 */
#define MSF1_B_test_MM_CTL_FORCE_SW_CLK(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MM_CTL_FORCE_SW_CLK_SHIFT)) & MSF1_B_test_MM_CTL_FORCE_SW_CLK_MASK)
/*! @} */

/*! @name UINT_CTL - User Interface Control Register */
/*! @{ */

#define MSF1_B_test_UINT_CTL_SET_FAIL_MASK       (0x1U)
#define MSF1_B_test_UINT_CTL_SET_FAIL_SHIFT      (0U)
/*! SET_FAIL - Set Fail On Exit
 *  0b0..FAIL flag should not be set on command exit (no failure detected)
 *  0b1..FAIL flag should be set on command exit
 */
#define MSF1_B_test_UINT_CTL_SET_FAIL(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_UINT_CTL_SET_FAIL_SHIFT)) & MSF1_B_test_UINT_CTL_SET_FAIL_MASK)

#define MSF1_B_test_UINT_CTL_DBERR_MASK          (0x2U)
#define MSF1_B_test_UINT_CTL_DBERR_SHIFT         (1U)
/*! DBERR - Double-Bit ECC Fault Detect
 *  0b0..No double-bit fault detected during UINT-driven read sequence
 *  0b1..Double-bit fault detected during UINT-driven read sequence
 */
#define MSF1_B_test_UINT_CTL_DBERR(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_UINT_CTL_DBERR_SHIFT)) & MSF1_B_test_UINT_CTL_DBERR_MASK)
/*! @} */

/*! @name RD_DATA0 - Read Data 0 Register */
/*! @{ */

#define MSF1_B_test_RD_DATA0_RD_DATA0_MASK       (0xFFFFFFFFU)
#define MSF1_B_test_RD_DATA0_RD_DATA0_SHIFT      (0U)
/*! RD_DATA0 - Read Data 0 */
#define MSF1_B_test_RD_DATA0_RD_DATA0(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_DATA0_RD_DATA0_SHIFT)) & MSF1_B_test_RD_DATA0_RD_DATA0_MASK)
/*! @} */

/*! @name RD_DATA1 - Read Data 1 Register */
/*! @{ */

#define MSF1_B_test_RD_DATA1_RD_DATA1_MASK       (0xFFFFFFFFU)
#define MSF1_B_test_RD_DATA1_RD_DATA1_SHIFT      (0U)
/*! RD_DATA1 - Read Data 1 */
#define MSF1_B_test_RD_DATA1_RD_DATA1(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_DATA1_RD_DATA1_SHIFT)) & MSF1_B_test_RD_DATA1_RD_DATA1_MASK)
/*! @} */

/*! @name RD_DATA2 - Read Data 2 Register */
/*! @{ */

