zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_RD_DATA2_RD_DATA2_MASK       (0xFFFFFFFFU)
#define MSF1_B_test_RD_DATA2_RD_DATA2_SHIFT      (0U)
/*! RD_DATA2 - Read Data 2 */
#define MSF1_B_test_RD_DATA2_RD_DATA2(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_DATA2_RD_DATA2_SHIFT)) & MSF1_B_test_RD_DATA2_RD_DATA2_MASK)
/*! @} */

/*! @name RD_DATA3 - Read Data 3 Register */
/*! @{ */

#define MSF1_B_test_RD_DATA3_RD_DATA3_MASK       (0xFFFFFFFFU)
#define MSF1_B_test_RD_DATA3_RD_DATA3_SHIFT      (0U)
/*! RD_DATA3 - Read Data 3 */
#define MSF1_B_test_RD_DATA3_RD_DATA3(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_DATA3_RD_DATA3_SHIFT)) & MSF1_B_test_RD_DATA3_RD_DATA3_MASK)
/*! @} */

/*! @name PARITY - Parity Register */
/*! @{ */

#define MSF1_B_test_PARITY_PARITY_MASK           (0x1FFU)
#define MSF1_B_test_PARITY_PARITY_SHIFT          (0U)
/*! PARITY - Read data [136:128] */
#define MSF1_B_test_PARITY_PARITY(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_PARITY_PARITY_SHIFT)) & MSF1_B_test_PARITY_PARITY_MASK)
/*! @} */

/*! @name RD_PATH_CTRL_STATUS - Read Path Control and Status Register */
/*! @{ */

#define MSF1_B_test_RD_PATH_CTRL_STATUS_RD_CAPT_MASK (0xFFU)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_RD_CAPT_SHIFT (0U)
/*! RD_CAPT - Read Capture Clock Periods */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_RD_CAPT(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_RD_CAPT_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_RD_CAPT_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_SE_SIZE_MASK (0xFF00U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_SE_SIZE_SHIFT (8U)
/*! SE_SIZE - SE Clock Periods */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_SE_SIZE(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_SE_SIZE_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_SE_SIZE_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_ECC_ENABLEB_MASK (0x10000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_ECC_ENABLEB_SHIFT (16U)
/*! ECC_ENABLEB - ECC Decoder Control
 *  0b0..ECC decoder enabled (default)
 *  0b1..ECC decoder disabled
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_ECC_ENABLEB(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_ECC_ENABLEB_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_ECC_ENABLEB_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_MISR_EN_MASK (0x20000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_MISR_EN_SHIFT (17U)
/*! MISR_EN - MISR Enable
 *  0b0..MISR option disabled (default)
 *  0b1..MISR option enabled
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_MISR_EN(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_MISR_EN_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_MISR_EN_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_CPY_PAR_EN_MASK (0x40000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_CPY_PAR_EN_SHIFT (18U)
/*! CPY_PAR_EN - Copy Parity Enable
 *  0b0..Copy parity disabled
 *  0b1..Copy parity enabled
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_CPY_PAR_EN(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_CPY_PAR_EN_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_CPY_PAR_EN_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_BIST_MUX_TO_SMW_MASK (0x80000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_BIST_MUX_TO_SMW_SHIFT (19U)
/*! BIST_MUX_TO_SMW - BIST Mux to SMW
 *  0b0..BIST drives fields
 *  0b1..SMW registers drive fields
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_BIST_MUX_TO_SMW(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_BIST_MUX_TO_SMW_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_BIST_MUX_TO_SMW_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_AD_SET_MASK (0xF00000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_AD_SET_SHIFT (20U)
/*! AD_SET - Multi-Cycle Address Setup Time */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_AD_SET(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_AD_SET_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_AD_SET_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_WR_PATH_EN_MASK (0x1000000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_WR_PATH_EN_SHIFT (24U)
/*! WR_PATH_EN - Write Path Enable
 *  0b0..Writes to BIST setting registers driven by MM_WDATA
 *  0b1..Writes to BIST setting registers driven by SMW_DIN
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_WR_PATH_EN(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_WR_PATH_EN_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_WR_PATH_EN_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_WR_PATH_ECC_EN_MASK (0x2000000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_WR_PATH_ECC_EN_SHIFT (25U)
/*! WR_PATH_ECC_EN - Write Path ECC Enable
 *  0b0..ECC encoding disabled
 *  0b1..ECC encoding enabled
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_WR_PATH_ECC_EN(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_WR_PATH_ECC_EN_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_WR_PATH_ECC_EN_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_DBERR_REG_MASK (0x4000000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_DBERR_REG_SHIFT (26U)
/*! DBERR_REG - Double-Bit Error
 *  0b0..Double-bit fault not detected
 *  0b1..Double-bit fault detected on previous UINT flash read
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_DBERR_REG(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_DBERR_REG_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_DBERR_REG_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_SBERR_REG_MASK (0x8000000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_SBERR_REG_SHIFT (27U)
/*! SBERR_REG - Single-Bit Error
 *  0b0..Single-bit fault not detected
 *  0b1..Single-bit fault detected on previous UINT flash read
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_SBERR_REG(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_SBERR_REG_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_SBERR_REG_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_CPY_PHRASE_EN_MASK (0x10000000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_CPY_PHRASE_EN_SHIFT (28U)
/*! CPY_PHRASE_EN - Copy Phrase Enable
 *  0b0..Copy Flash read data disabled
 *  0b1..Copy Flash read data enabled
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_CPY_PHRASE_EN(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_CPY_PHRASE_EN_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_CPY_PHRASE_EN_MASK)

