zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_RD_PATH_CTRL_STATUS_SMW_ARRAY1_SMW0_SEL_MASK (0x20000000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_SMW_ARRAY1_SMW0_SEL_SHIFT (29U)
/*! SMW_ARRAY1_SMW0_SEL - SMW_ARRAY1_SMW0_SEL
 *  0b0..Select block 0
 *  0b1..Select block 1
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_SMW_ARRAY1_SMW0_SEL(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_SMW_ARRAY1_SMW0_SEL_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_SMW_ARRAY1_SMW0_SEL_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_BIST_ECC_EN_MASK (0x40000000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_BIST_ECC_EN_SHIFT (30U)
/*! BIST_ECC_EN - BIST ECC Enable
 *  0b0..ECC correction disabled
 *  0b1..ECC correction enabled
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_BIST_ECC_EN(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_BIST_ECC_EN_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_BIST_ECC_EN_MASK)

#define MSF1_B_test_RD_PATH_CTRL_STATUS_LAST_READ_MASK (0x80000000U)
#define MSF1_B_test_RD_PATH_CTRL_STATUS_LAST_READ_SHIFT (31U)
/*! LAST_READ - Last Read
 *  0b0..Latest read not last in multi-address operation
 *  0b1..Latest read last in multi-address operation
 */
#define MSF1_B_test_RD_PATH_CTRL_STATUS_LAST_READ(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_RD_PATH_CTRL_STATUS_LAST_READ_SHIFT)) & MSF1_B_test_RD_PATH_CTRL_STATUS_LAST_READ_MASK)
/*! @} */

/*! @name SMW_DIN0 - SMW DIN 0 Register */
/*! @{ */

#define MSF1_B_test_SMW_DIN0_SMW_DIN0_MASK       (0xFFFFFFFFU)
#define MSF1_B_test_SMW_DIN0_SMW_DIN0_SHIFT      (0U)
/*! SMW_DIN0 - SMW DIN 0 */
#define MSF1_B_test_SMW_DIN0_SMW_DIN0(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_DIN0_SMW_DIN0_SHIFT)) & MSF1_B_test_SMW_DIN0_SMW_DIN0_MASK)
/*! @} */

/*! @name SMW_DIN1 - SMW DIN 1 Register */
/*! @{ */

#define MSF1_B_test_SMW_DIN1_SMW_DIN1_MASK       (0xFFFFFFFFU)
#define MSF1_B_test_SMW_DIN1_SMW_DIN1_SHIFT      (0U)
/*! SMW_DIN1 - SMW DIN 1 */
#define MSF1_B_test_SMW_DIN1_SMW_DIN1(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_DIN1_SMW_DIN1_SHIFT)) & MSF1_B_test_SMW_DIN1_SMW_DIN1_MASK)
/*! @} */

/*! @name SMW_DIN2 - SMW DIN 2 Register */
/*! @{ */

#define MSF1_B_test_SMW_DIN2_SMW_DIN2_MASK       (0xFFFFFFFFU)
#define MSF1_B_test_SMW_DIN2_SMW_DIN2_SHIFT      (0U)
/*! SMW_DIN2 - SMW DIN 2 */
#define MSF1_B_test_SMW_DIN2_SMW_DIN2(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_DIN2_SMW_DIN2_SHIFT)) & MSF1_B_test_SMW_DIN2_SMW_DIN2_MASK)
/*! @} */

/*! @name SMW_DIN3 - SMW DIN 3 Register */
/*! @{ */

#define MSF1_B_test_SMW_DIN3_SMW_DIN3_MASK       (0xFFFFFFFFU)
#define MSF1_B_test_SMW_DIN3_SMW_DIN3_SHIFT      (0U)
/*! SMW_DIN3 - SMW DIN 3 */
#define MSF1_B_test_SMW_DIN3_SMW_DIN3(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_DIN3_SMW_DIN3_SHIFT)) & MSF1_B_test_SMW_DIN3_SMW_DIN3_MASK)
/*! @} */

/*! @name SMW_ADDR - SMW Address Register */
/*! @{ */

#define MSF1_B_test_SMW_ADDR_SMW_ADDR_MASK       (0xFFFFFFFFU)
#define MSF1_B_test_SMW_ADDR_SMW_ADDR_SHIFT      (0U)
/*! SMW_ADDR - SMW Address */
#define MSF1_B_test_SMW_ADDR_SMW_ADDR(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_ADDR_SMW_ADDR_SHIFT)) & MSF1_B_test_SMW_ADDR_SMW_ADDR_MASK)
/*! @} */

/*! @name SMW_CMD_WAIT - SMW Command and Wait Register */
/*! @{ */

#define MSF1_B_test_SMW_CMD_WAIT_CMD_MASK        (0x7U)
#define MSF1_B_test_SMW_CMD_WAIT_CMD_SHIFT       (0U)
/*! CMD - SMW Command
 *  0b000..IDLE
 *  0b001..ABORT
 *  0b010..SME2 to one-shot mass erase
 *  0b011..SME3 to sector erase on selected array
 *  0b100..SMP1 to program phrase or page on selected array with shot disabled on previously programmed bit
 *  0b101..Reserved for SME4 (multi-sector erase)
 *  0b110..SMP2 to program phrase or page on selected array to repair cells of weak program after power loss
 *  0b111..Reserved
 */
#define MSF1_B_test_SMW_CMD_WAIT_CMD(x)          (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_CMD_WAIT_CMD_SHIFT)) & MSF1_B_test_SMW_CMD_WAIT_CMD_MASK)

#define MSF1_B_test_SMW_CMD_WAIT_WAIT_EN_MASK    (0x8U)
#define MSF1_B_test_SMW_CMD_WAIT_WAIT_EN_SHIFT   (3U)
/*! WAIT_EN - SMW Wait Enable
 *  0b0..Wait feature disabled
 *  0b1..Wait feature enabled
 */
#define MSF1_B_test_SMW_CMD_WAIT_WAIT_EN(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_CMD_WAIT_WAIT_EN_SHIFT)) & MSF1_B_test_SMW_CMD_WAIT_WAIT_EN_MASK)

#define MSF1_B_test_SMW_CMD_WAIT_WAIT_AUTO_SET_MASK (0x10U)
#define MSF1_B_test_SMW_CMD_WAIT_WAIT_AUTO_SET_SHIFT (4U)
/*! WAIT_AUTO_SET - SMW Wait Auto Set */
#define MSF1_B_test_SMW_CMD_WAIT_WAIT_AUTO_SET(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_CMD_WAIT_WAIT_AUTO_SET_SHIFT)) & MSF1_B_test_SMW_CMD_WAIT_WAIT_AUTO_SET_MASK)
/*! @} */

/*! @name SMW_STATUS - SMW Status Register */
/*! @{ */

#define MSF1_B_test_SMW_STATUS_SMW_ERR_MASK      (0x1U)
#define MSF1_B_test_SMW_STATUS_SMW_ERR_SHIFT     (0U)
/*! SMW_ERR - SMW Error
 *  0b0..Error not detected
 *  0b1..Error detected
 */
#define MSF1_B_test_SMW_STATUS_SMW_ERR(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_STATUS_SMW_ERR_SHIFT)) & MSF1_B_test_SMW_STATUS_SMW_ERR_MASK)

#define MSF1_B_test_SMW_STATUS_SMW_BUSY_MASK     (0x2U)
#define MSF1_B_test_SMW_STATUS_SMW_BUSY_SHIFT    (1U)
/*! SMW_BUSY - SMW Busy
 *  0b0..SMW command not active
 *  0b1..SMW command is active
 */
#define MSF1_B_test_SMW_STATUS_SMW_BUSY(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_STATUS_SMW_BUSY_SHIFT)) & MSF1_B_test_SMW_STATUS_SMW_BUSY_MASK)

#define MSF1_B_test_SMW_STATUS_BIST_BUSY_MASK    (0x4U)
#define MSF1_B_test_SMW_STATUS_BIST_BUSY_SHIFT   (2U)
/*! BIST_BUSY - BIST Busy
 *  0b0..BIST Command not active
 *  0b1..BIST Command is active
 */
#define MSF1_B_test_SMW_STATUS_BIST_BUSY(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_STATUS_BIST_BUSY_SHIFT)) & MSF1_B_test_SMW_STATUS_BIST_BUSY_MASK)
/*! @} */

/*! @name SOCTRIM0_0 - SoC Trim Phrase 0 Word 0 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM0_0_TRIM0_0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM0_0_TRIM0_0_SHIFT     (0U)
/*! TRIM0_0 - TRIM0_0 */
#define MSF1_B_test_SOCTRIM0_0_TRIM0_0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM0_0_TRIM0_0_SHIFT)) & MSF1_B_test_SOCTRIM0_0_TRIM0_0_MASK)
/*! @} */

/*! @name SOCTRIM0_1 - SoC Trim Phrase 0 Word 1 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM0_1_TRIM0_1_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM0_1_TRIM0_1_SHIFT     (0U)
/*! TRIM0_1 - TRIM0_1 */
#define MSF1_B_test_SOCTRIM0_1_TRIM0_1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM0_1_TRIM0_1_SHIFT)) & MSF1_B_test_SOCTRIM0_1_TRIM0_1_MASK)
/*! @} */

/*! @name SOCTRIM0_2 - SoC Trim Phrase 0 Word 2 Register */
/*! @{ */

