zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_SOCTRIM0_2_TRIM0_2_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM0_2_TRIM0_2_SHIFT     (0U)
/*! TRIM0_2 - TRIM0_2 */
#define MSF1_B_test_SOCTRIM0_2_TRIM0_2(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM0_2_TRIM0_2_SHIFT)) & MSF1_B_test_SOCTRIM0_2_TRIM0_2_MASK)
/*! @} */

/*! @name SOCTRIM0_3 - SoC Trim Phrase 0 Word 3 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM0_3_TRIM0_3_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM0_3_TRIM0_3_SHIFT     (0U)
/*! TRIM0_3 - TRIM0_3 */
#define MSF1_B_test_SOCTRIM0_3_TRIM0_3(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM0_3_TRIM0_3_SHIFT)) & MSF1_B_test_SOCTRIM0_3_TRIM0_3_MASK)
/*! @} */

/*! @name SOCTRIM1_0 - SoC Trim Phrase 1 Word 0 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM1_0_TRIM1_0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM1_0_TRIM1_0_SHIFT     (0U)
/*! TRIM1_0 - TRIM1_0 */
#define MSF1_B_test_SOCTRIM1_0_TRIM1_0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM1_0_TRIM1_0_SHIFT)) & MSF1_B_test_SOCTRIM1_0_TRIM1_0_MASK)
/*! @} */

/*! @name SOCTRIM1_1 - SoC Trim Phrase 1 Word 1 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM1_1_TRIM1_1_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM1_1_TRIM1_1_SHIFT     (0U)
/*! TRIM1_1 - TRIM1_1 */
#define MSF1_B_test_SOCTRIM1_1_TRIM1_1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM1_1_TRIM1_1_SHIFT)) & MSF1_B_test_SOCTRIM1_1_TRIM1_1_MASK)
/*! @} */

/*! @name SOCTRIM1_2 - SoC Trim Phrase 1 Word 2 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM1_2_TRIM1_2_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM1_2_TRIM1_2_SHIFT     (0U)
/*! TRIM1_2 - TRIM1_2 */
#define MSF1_B_test_SOCTRIM1_2_TRIM1_2(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM1_2_TRIM1_2_SHIFT)) & MSF1_B_test_SOCTRIM1_2_TRIM1_2_MASK)
/*! @} */

/*! @name SOCTRIM1_3 - SoC Trim Phrase 1 Word 3 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM1_3_TRIM1_3_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM1_3_TRIM1_3_SHIFT     (0U)
/*! TRIM1_3 - TRIM1_3 */
#define MSF1_B_test_SOCTRIM1_3_TRIM1_3(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM1_3_TRIM1_3_SHIFT)) & MSF1_B_test_SOCTRIM1_3_TRIM1_3_MASK)
/*! @} */

/*! @name SOCTRIM2_0 - SoC Trim Phrase 2 Word 0 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM2_0_TRIM2_0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM2_0_TRIM2_0_SHIFT     (0U)
/*! TRIM2_0 - TRIM2_0 */
#define MSF1_B_test_SOCTRIM2_0_TRIM2_0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM2_0_TRIM2_0_SHIFT)) & MSF1_B_test_SOCTRIM2_0_TRIM2_0_MASK)
/*! @} */

/*! @name SOCTRIM2_1 - SoC Trim Phrase 2 Word 1 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM2_1_TRIM2_1_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM2_1_TRIM2_1_SHIFT     (0U)
/*! TRIM2_1 - TRIM2_1 */
#define MSF1_B_test_SOCTRIM2_1_TRIM2_1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM2_1_TRIM2_1_SHIFT)) & MSF1_B_test_SOCTRIM2_1_TRIM2_1_MASK)
/*! @} */

/*! @name SOCTRIM2_2 - SoC Trim Phrase 2 Word 2 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM2_2_TRIM2_2_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM2_2_TRIM2_2_SHIFT     (0U)
/*! TRIM2_2 - TRIM2_2 */
#define MSF1_B_test_SOCTRIM2_2_TRIM2_2(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM2_2_TRIM2_2_SHIFT)) & MSF1_B_test_SOCTRIM2_2_TRIM2_2_MASK)
/*! @} */

/*! @name SOCTRIM2_3 - SoC Trim Phrase 2 Word 3 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM2_3_TRIM2_3_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM2_3_TRIM2_3_SHIFT     (0U)
/*! TRIM2_3 - TRIM2_3 */
#define MSF1_B_test_SOCTRIM2_3_TRIM2_3(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM2_3_TRIM2_3_SHIFT)) & MSF1_B_test_SOCTRIM2_3_TRIM2_3_MASK)
/*! @} */

/*! @name SOCTRIM3_0 - SoC Trim Phrase 3 Word 0 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM3_0_TRIM3_0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM3_0_TRIM3_0_SHIFT     (0U)
/*! TRIM3_0 - TRIM3_0 */
#define MSF1_B_test_SOCTRIM3_0_TRIM3_0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM3_0_TRIM3_0_SHIFT)) & MSF1_B_test_SOCTRIM3_0_TRIM3_0_MASK)
/*! @} */

/*! @name SOCTRIM3_1 - SoC Trim Phrase 3 Word 1 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM3_1_TRIM3_1_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM3_1_TRIM3_1_SHIFT     (0U)
/*! TRIM3_1 - TRIM3_1 */
#define MSF1_B_test_SOCTRIM3_1_TRIM3_1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM3_1_TRIM3_1_SHIFT)) & MSF1_B_test_SOCTRIM3_1_TRIM3_1_MASK)
/*! @} */

/*! @name SOCTRIM3_2 - SoC Trim Phrase 3 Word 2 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM3_2_TRIM3_2_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM3_2_TRIM3_2_SHIFT     (0U)
/*! TRIM3_2 - TRIM3_2 */
#define MSF1_B_test_SOCTRIM3_2_TRIM3_2(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM3_2_TRIM3_2_SHIFT)) & MSF1_B_test_SOCTRIM3_2_TRIM3_2_MASK)
/*! @} */

/*! @name SOCTRIM3_3 - SoC Trim Phrase 3 Word 3 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM3_3_TRIM3_3_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM3_3_TRIM3_3_SHIFT     (0U)
/*! TRIM3_3 - TRIM3_3 */
#define MSF1_B_test_SOCTRIM3_3_TRIM3_3(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM3_3_TRIM3_3_SHIFT)) & MSF1_B_test_SOCTRIM3_3_TRIM3_3_MASK)
/*! @} */

/*! @name SOCTRIM4_0 - SoC Trim Phrase 4 Word 0 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM4_0_TRIM4_0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM4_0_TRIM4_0_SHIFT     (0U)
/*! TRIM4_0 - TRIM4_0 */
#define MSF1_B_test_SOCTRIM4_0_TRIM4_0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM4_0_TRIM4_0_SHIFT)) & MSF1_B_test_SOCTRIM4_0_TRIM4_0_MASK)
/*! @} */

/*! @name SOCTRIM4_1 - SoC Trim Phrase 4 Word 1 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM4_1_TRIM4_1_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM4_1_TRIM4_1_SHIFT     (0U)
/*! TRIM4_1 - TRIM4_1 */
#define MSF1_B_test_SOCTRIM4_1_TRIM4_1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM4_1_TRIM4_1_SHIFT)) & MSF1_B_test_SOCTRIM4_1_TRIM4_1_MASK)
/*! @} */

/*! @name SOCTRIM4_2 - SoC Trim Phrase 4 Word 2 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM4_2_TRIM4_2_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM4_2_TRIM4_2_SHIFT     (0U)
/*! TRIM4_2 - TRIM4_2 */
#define MSF1_B_test_SOCTRIM4_2_TRIM4_2(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM4_2_TRIM4_2_SHIFT)) & MSF1_B_test_SOCTRIM4_2_TRIM4_2_MASK)
/*! @} */

/*! @name SOCTRIM4_3 - SoC Trim Phrase 4 Word 3 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM4_3_TRIM4_3_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM4_3_TRIM4_3_SHIFT     (0U)
/*! TRIM4_3 - TRIM4_3 */
#define MSF1_B_test_SOCTRIM4_3_TRIM4_3(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM4_3_TRIM4_3_SHIFT)) & MSF1_B_test_SOCTRIM4_3_TRIM4_3_MASK)
/*! @} */

/*! @name SOCTRIM5_0 - SoC Trim Phrase 5 Word 0 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM5_0_TRIM5_0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM5_0_TRIM5_0_SHIFT     (0U)
/*! TRIM5_0 - TRIM5_0 */
#define MSF1_B_test_SOCTRIM5_0_TRIM5_0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM5_0_TRIM5_0_SHIFT)) & MSF1_B_test_SOCTRIM5_0_TRIM5_0_MASK)
/*! @} */

/*! @name SOCTRIM5_1 - SoC Trim Phrase 5 Word 1 Register */
/*! @{ */

