zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_SOCTRIM5_1_TRIM5_1_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM5_1_TRIM5_1_SHIFT     (0U)
/*! TRIM5_1 - TRIM5_1 */
#define MSF1_B_test_SOCTRIM5_1_TRIM5_1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM5_1_TRIM5_1_SHIFT)) & MSF1_B_test_SOCTRIM5_1_TRIM5_1_MASK)
/*! @} */

/*! @name SOCTRIM5_2 - SoC Trim Phrase 5 Word 2 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM5_2_TRIM5_2_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM5_2_TRIM5_2_SHIFT     (0U)
/*! TRIM5_2 - TRIM5_2 */
#define MSF1_B_test_SOCTRIM5_2_TRIM5_2(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM5_2_TRIM5_2_SHIFT)) & MSF1_B_test_SOCTRIM5_2_TRIM5_2_MASK)
/*! @} */

/*! @name SOCTRIM5_3 - SoC Trim Phrase 5 Word 3 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM5_3_TRIM5_3_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM5_3_TRIM5_3_SHIFT     (0U)
/*! TRIM5_3 - TRIM5_3 */
#define MSF1_B_test_SOCTRIM5_3_TRIM5_3(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM5_3_TRIM5_3_SHIFT)) & MSF1_B_test_SOCTRIM5_3_TRIM5_3_MASK)
/*! @} */

/*! @name SOCTRIM6_0 - SoC Trim Phrase 6 Word 0 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM6_0_TRIM6_0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM6_0_TRIM6_0_SHIFT     (0U)
/*! TRIM6_0 - TRIM6_0 */
#define MSF1_B_test_SOCTRIM6_0_TRIM6_0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM6_0_TRIM6_0_SHIFT)) & MSF1_B_test_SOCTRIM6_0_TRIM6_0_MASK)
/*! @} */

/*! @name SOCTRIM6_1 - SoC Trim Phrase 6 Word 1 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM6_1_TRIM6_1_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM6_1_TRIM6_1_SHIFT     (0U)
/*! TRIM6_1 - TRIM6_1 */
#define MSF1_B_test_SOCTRIM6_1_TRIM6_1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM6_1_TRIM6_1_SHIFT)) & MSF1_B_test_SOCTRIM6_1_TRIM6_1_MASK)
/*! @} */

/*! @name SOCTRIM6_2 - SoC Trim Phrase 6 Word 2 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM6_2_TRIM6_2_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM6_2_TRIM6_2_SHIFT     (0U)
/*! TRIM6_2 - TRIM6_2 */
#define MSF1_B_test_SOCTRIM6_2_TRIM6_2(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM6_2_TRIM6_2_SHIFT)) & MSF1_B_test_SOCTRIM6_2_TRIM6_2_MASK)
/*! @} */

/*! @name SOCTRIM6_3 - SoC Trim Phrase 6 Word 3 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM6_3_TRIM6_3_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM6_3_TRIM6_3_SHIFT     (0U)
/*! TRIM6_3 - TRIM6_3 */
#define MSF1_B_test_SOCTRIM6_3_TRIM6_3(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM6_3_TRIM6_3_SHIFT)) & MSF1_B_test_SOCTRIM6_3_TRIM6_3_MASK)
/*! @} */

/*! @name SOCTRIM7_0 - SoC Trim Phrase 7 Word 0 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM7_0_TRIM7_0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM7_0_TRIM7_0_SHIFT     (0U)
/*! TRIM7_0 - TRIM7_0 */
#define MSF1_B_test_SOCTRIM7_0_TRIM7_0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM7_0_TRIM7_0_SHIFT)) & MSF1_B_test_SOCTRIM7_0_TRIM7_0_MASK)
/*! @} */

/*! @name SOCTRIM7_1 - SoC Trim Phrase 7 Word 1 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM7_1_TRIM7_1_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM7_1_TRIM7_1_SHIFT     (0U)
/*! TRIM7_1 - TRIM7_1 */
#define MSF1_B_test_SOCTRIM7_1_TRIM7_1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM7_1_TRIM7_1_SHIFT)) & MSF1_B_test_SOCTRIM7_1_TRIM7_1_MASK)
/*! @} */

/*! @name SOCTRIM7_2 - SoC Trim Phrase 7 Word 2 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM7_2_TRIM7_2_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM7_2_TRIM7_2_SHIFT     (0U)
/*! TRIM7_2 - TRIM7_2 */
#define MSF1_B_test_SOCTRIM7_2_TRIM7_2(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM7_2_TRIM7_2_SHIFT)) & MSF1_B_test_SOCTRIM7_2_TRIM7_2_MASK)
/*! @} */

/*! @name SOCTRIM7_3 - SoC Trim Phrase 7 Word 3 Register */
/*! @{ */

#define MSF1_B_test_SOCTRIM7_3_TRIM7_3_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_SOCTRIM7_3_TRIM7_3_SHIFT     (0U)
/*! TRIM7_3 - TRIM7_3 */
#define MSF1_B_test_SOCTRIM7_3_TRIM7_3(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SOCTRIM7_3_TRIM7_3_SHIFT)) & MSF1_B_test_SOCTRIM7_3_TRIM7_3_MASK)
/*! @} */

/*! @name R_IP_CONFIG - BIST Configuration Register */
/*! @{ */

#define MSF1_B_test_R_IP_CONFIG_IPSEL0_MASK      (0x3U)
#define MSF1_B_test_R_IP_CONFIG_IPSEL0_SHIFT     (0U)
/*! IPSEL0 - Block 0 Select Control
 *  0b00..Unselect block 0
 *  0b01..not used, reserved
 *  0b10..Enable block 0 test, repair off (default)
 *  0b11..Enable block 0 test, repair on
 */
#define MSF1_B_test_R_IP_CONFIG_IPSEL0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_IP_CONFIG_IPSEL0_SHIFT)) & MSF1_B_test_R_IP_CONFIG_IPSEL0_MASK)

#define MSF1_B_test_R_IP_CONFIG_IPSEL1_MASK      (0xCU)
#define MSF1_B_test_R_IP_CONFIG_IPSEL1_SHIFT     (2U)
/*! IPSEL1 - Block 1 Select Control
 *  0b00..Unselect block 1
 *  0b01..not used, reserved
 *  0b10..Enable block 1 test, repair off (default)
 *  0b11..Enable block 1 test, repair on
 */
#define MSF1_B_test_R_IP_CONFIG_IPSEL1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_IP_CONFIG_IPSEL1_SHIFT)) & MSF1_B_test_R_IP_CONFIG_IPSEL1_MASK)

#define MSF1_B_test_R_IP_CONFIG_BIST_CDIVL_MASK  (0xFF0U)
#define MSF1_B_test_R_IP_CONFIG_BIST_CDIVL_SHIFT (4U)
/*! BIST_CDIVL - Clock Divide Scalar for Long Pulse */
#define MSF1_B_test_R_IP_CONFIG_BIST_CDIVL(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_IP_CONFIG_BIST_CDIVL_SHIFT)) & MSF1_B_test_R_IP_CONFIG_BIST_CDIVL_MASK)

#define MSF1_B_test_R_IP_CONFIG_CDIVS_MASK       (0x7000U)
#define MSF1_B_test_R_IP_CONFIG_CDIVS_SHIFT      (12U)
/*! CDIVS - Number of clock cycles to generate short pulse */
#define MSF1_B_test_R_IP_CONFIG_CDIVS(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_IP_CONFIG_CDIVS_SHIFT)) & MSF1_B_test_R_IP_CONFIG_CDIVS_MASK)

#define MSF1_B_test_R_IP_CONFIG_BIST_TVFY_MASK   (0xF8000U)
#define MSF1_B_test_R_IP_CONFIG_BIST_TVFY_SHIFT  (15U)
/*! BIST_TVFY - Timer adjust for verify */
#define MSF1_B_test_R_IP_CONFIG_BIST_TVFY(x)     (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_IP_CONFIG_BIST_TVFY_SHIFT)) & MSF1_B_test_R_IP_CONFIG_BIST_TVFY_MASK)

