zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_R_IP_CONFIG_TSTCTL_MASK      (0x300000U)
#define MSF1_B_test_R_IP_CONFIG_TSTCTL_SHIFT     (20U)
/*! TSTCTL - BIST self-test control
 *  0b00..Default, disable both BIST self-test and MISR
 *  0b01..Enable BIST self-test mode DOUT from macro will be forced to '0', and disable MISR.
 *  0b10..Enable MISR
 *  0b11..Enable both BIST self-test mode and MISR
 */
#define MSF1_B_test_R_IP_CONFIG_TSTCTL(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_IP_CONFIG_TSTCTL_SHIFT)) & MSF1_B_test_R_IP_CONFIG_TSTCTL_MASK)

#define MSF1_B_test_R_IP_CONFIG_DBGCTL_MASK      (0x400000U)
#define MSF1_B_test_R_IP_CONFIG_DBGCTL_SHIFT     (22U)
/*! DBGCTL - Debug feature control
 *  0b0..Default
 *  0b1..Enable debug feature to collect failure address and data.
 */
#define MSF1_B_test_R_IP_CONFIG_DBGCTL(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_IP_CONFIG_DBGCTL_SHIFT)) & MSF1_B_test_R_IP_CONFIG_DBGCTL_MASK)

#define MSF1_B_test_R_IP_CONFIG_BIST_CLK_SEL_MASK (0x800000U)
#define MSF1_B_test_R_IP_CONFIG_BIST_CLK_SEL_SHIFT (23U)
/*! BIST_CLK_SEL - BIST Clock Select */
#define MSF1_B_test_R_IP_CONFIG_BIST_CLK_SEL(x)  (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_IP_CONFIG_BIST_CLK_SEL_SHIFT)) & MSF1_B_test_R_IP_CONFIG_BIST_CLK_SEL_MASK)

#define MSF1_B_test_R_IP_CONFIG_SMWTST_MASK      (0x3000000U)
#define MSF1_B_test_R_IP_CONFIG_SMWTST_SHIFT     (24U)
/*! SMWTST - SMWR DOUT Function Control
 *  0b00..Default
 *  0b01..Enable SMWR self-test mode, DOUT from macro will be forced to all 0
 *  0b10..Enable SMWR self-test mode, DOUT from macro will be forced to all 1
 *  0b11..Reserved (unused)
 */
#define MSF1_B_test_R_IP_CONFIG_SMWTST(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_IP_CONFIG_SMWTST_SHIFT)) & MSF1_B_test_R_IP_CONFIG_SMWTST_MASK)

#define MSF1_B_test_R_IP_CONFIG_ECCEN_MASK       (0x4000000U)
#define MSF1_B_test_R_IP_CONFIG_ECCEN_SHIFT      (26U)
/*! ECCEN - BIST ECC Control
 *  0b0..Default mode (no ECC encode or decode)
 *  0b1..Enable ECC encode/decode
 */
#define MSF1_B_test_R_IP_CONFIG_ECCEN(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_IP_CONFIG_ECCEN_SHIFT)) & MSF1_B_test_R_IP_CONFIG_ECCEN_MASK)
/*! @} */

/*! @name R_TESTCODE - BIST Test Code Register */
/*! @{ */

#define MSF1_B_test_R_TESTCODE_TESTCODE_MASK     (0x3FU)
#define MSF1_B_test_R_TESTCODE_TESTCODE_SHIFT    (0U)
/*! TESTCODE - Used to store test code information before running TMR-RST/TMRSET BIST command */
#define MSF1_B_test_R_TESTCODE_TESTCODE(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TESTCODE_TESTCODE_SHIFT)) & MSF1_B_test_R_TESTCODE_TESTCODE_MASK)
/*! @} */

/*! @name R_DFT_CTRL - BIST DFT Control Register */
/*! @{ */

#define MSF1_B_test_R_DFT_CTRL_DFT_XADR_MASK     (0xFU)
#define MSF1_B_test_R_DFT_CTRL_DFT_XADR_SHIFT    (0U)
/*! DFT_XADR - DFT XADR Pattern
 *  0b0000..XADR fixed, no change at all
 *  0b0001..XADR increased by 1 after row. For READ operation, XADR increases by 1 after reading the last word of
 *          row. For PROG operation, XADR increases by 1 after NVSTR falls.
 *  0b0010..XADR increased for diagonal. For PROG-DIAGONAL operation, XADR is increased to create diagonal pattern.
 *  0b0011..XADR increased by sector. During ERASE operation, XADR increased by number of rows in a sector when NVSTR falls.
 *  0b0100..XADR inversed. XADR is inversed after reading one word or after programming one row when NVSTR falls.
 *  0b0101..XADR increased by 2 after row. For READ operation, XADR is increased by 2 after reading the last word
 *          of a row. For PROG operation, XADR is increased by 2 when NVSTR falls.
 *  0b0110..XADR[0] inversed. XADR[0] is inversed after reading one word or after programming one row when NVSTR falls.
 *  0b0111..XADR increased by 1. For READ operations only, XADR increased by 1 after each read cycle.
 *  0b1000..XADR decreased by 1 after row. For READ operations only, XADR is decreased by 1 after YADR decreases to 0.
 *  0b1001..XADR decreased by 1. For READ operations only, XADR is decreased by 1 after each read cycle.
 */
#define MSF1_B_test_R_DFT_CTRL_DFT_XADR(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DFT_CTRL_DFT_XADR_SHIFT)) & MSF1_B_test_R_DFT_CTRL_DFT_XADR_MASK)

#define MSF1_B_test_R_DFT_CTRL_DFT_YADR_MASK     (0xF0U)
#define MSF1_B_test_R_DFT_CTRL_DFT_YADR_SHIFT    (4U)
/*! DFT_YADR - DFT YADR Pattern
 *  0b0000..YADR fixed, no change at all
 *  0b0001..YADR for ICKBD. For PROG and READ operations, YADR changed to generate inverse checkerboard pattern.
 *  0b0010..YADR for CKBD. For PROG and READ operations, YADR changed to generate checkerboard pattern.
 *  0b0011..YADR increased by 1. For READ operations, YADR increased by 1 after each read cycle. For PROG
 *          operations, YADR increased by 1 after YE falls.
 *  0b0100..YADR increased for diagonal. For PROG-DIAGONAL operation, YADR is increased to create diagonal pattern.
 *  0b0101..YADR inversed. YADR is inversed after reading one word or after programming one word when YE falls.
 *  0b0110..YADR[0] inversed. YADR[0] is inversed after reading one word or after programming one word when YE falls.
 *  0b0111..YADR increased by 1 after last row. For READ operations only, YADR is increased by 1 after XADR reaches last row.
 *  0b1000..YADR decreased by 1. For READ operations only, YADR is decreased by 1 after each read cycle.
 *  0b1001..YADR decreased by 1 after first row. For READ operations only, YADR is decreased by 1 after XADR decreases to 0.
 */
#define MSF1_B_test_R_DFT_CTRL_DFT_YADR(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DFT_CTRL_DFT_YADR_SHIFT)) & MSF1_B_test_R_DFT_CTRL_DFT_YADR_MASK)

#define MSF1_B_test_R_DFT_CTRL_DFT_DATA_MASK     (0xF00U)
#define MSF1_B_test_R_DFT_CTRL_DFT_DATA_SHIFT    (8U)
/*! DFT_DATA - DFT Data Pattern
 *  0b0000..CKBD pattern. For READ operations only, compare DOUT with checkerboard data pattern for each read cycle.
 *  0b0001..ICKBD pattern. For READ operations only, compare DOUT with inverse checkerboard data pattern for each read cycle.
 *  0b0010..Diagonal pattern. Used for READ operations only, compare DOUT to diagonal pattern.
 *  0b0011..Fixed data pattern. For READ operations, comparison to DOUT for selected groups; refer to
 *          R_ADR_CTRL[GRPSEL] for modules with multiple groups.
 *  0b0100..Random data pattern which will be generated based on the initial seed set in R_DATA; for READ
 *          operations, used for DOUT comparison of selected groups. For PROG operations, used to control DIN of selected
 *          groups.
 *  0b0101..DOUT based pattern. For READ operations only, DOUT of selected group will be latched in R_DATA. If
 *          more than one group is selected in R_ADR_CTRL[GRPSEL], the group with the lower index will be latched.
 *  0b0110..R_DATA based pattern. For READ operations, expected DOUT value of selected groups equals to R_DATA
 *          when XADR[0]==YADR[0] or ~R_DATA when XADR[0]!=YADR[0]. For PROG operations, DIN of selected groups equals
 *          R_DATA when XADR[0]==YADR[0] or ~R_DATA when XADR[0]!=YADR[0].
 *  0b0111..SCAN-IO pattern. For READ operations, control expected DOUT value of selected groups to SCAN-IO data
 *          pattern. For PROG operations, control DIN of selected groups to SCAN-IO data pattern.
 *  0b1000..REPAIR set. For PROG operation to IFR1(7,1) and IFR1(7,2), R_REPAIR0_0 and R_REPAIR0_1 or R_REPAIR1_0
 *          and R_REPAIR1_1 will control DIN. For READ operation on IFR1(7,1) and IFR1(7,2), DOUT will be compared
 *          against R_REPAIR0_0 and R_REPAIR0_1 or R_REPAIR1_0 andR_REPAIR1_1. When this option is selected, only
 *          one flash block can be selected.
 *  0b1001..REPAIR load. For READ operation only, DOUT from IFR1(7,1) and IFR1(7,2) is loaded to R_REPAIR0 and R_REPAIR1.
 */
#define MSF1_B_test_R_DFT_CTRL_DFT_DATA(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DFT_CTRL_DFT_DATA_SHIFT)) & MSF1_B_test_R_DFT_CTRL_DFT_DATA_MASK)

#define MSF1_B_test_R_DFT_CTRL_CMP_MASK_MASK     (0x3000U)
#define MSF1_B_test_R_DFT_CTRL_CMP_MASK_SHIFT    (12U)
/*! CMP_MASK - Data Compare Mask
 *  0b00..Expected data is compared to DOUT
 *  0b01..Expected data (only 0s are considered) are compared to DOUT
 *  0b10..Expected data (only 1s are considered) are compared to DOUT
 */
#define MSF1_B_test_R_DFT_CTRL_CMP_MASK(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DFT_CTRL_CMP_MASK_SHIFT)) & MSF1_B_test_R_DFT_CTRL_CMP_MASK_MASK)

#define MSF1_B_test_R_DFT_CTRL_DFT_DATA_SRC_MASK (0x4000U)
#define MSF1_B_test_R_DFT_CTRL_DFT_DATA_SRC_SHIFT (14U)
/*! DFT_DATA_SRC - DFT Data Source
 *  0b0..{R_DATA_CTRL0,R_DATA_CTRL_EX[2:0],R_DATA_CTRL0,R_DATA_CTRL_EX[2:0],R_DATA_CTRL0,R_DATA_CTRL_EX[2:0],R_DATA_CTRL0} is used
 *  0b1..{R_DATA_CTRL3,R_DATA_CTRL2_EX[2:0],R_DATA_CTRL2,R_DATA_CTRL1_EX[2:0],R_DATA_CTRL1,R_DATA_CTRL_EX[2:0],R_DATA_CTRL0} is used
 */
#define MSF1_B_test_R_DFT_CTRL_DFT_DATA_SRC(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DFT_CTRL_DFT_DATA_SRC_SHIFT)) & MSF1_B_test_R_DFT_CTRL_DFT_DATA_SRC_MASK)
/*! @} */

