zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
/*! @name R_ADR_CTRL - BIST Address Control Register */
/*! @{ */

#define MSF1_B_test_R_ADR_CTRL_GRPSEL_MASK       (0xFU)
#define MSF1_B_test_R_ADR_CTRL_GRPSEL_SHIFT      (0U)
/*! GRPSEL - Data Group Select
 *  0b0000..Select no data
 *  0b0001..Select data slice [34:0]
 *  0b0010..Select data slice [69:35]
 *  0b0100..Select data slice [104:70]
 *  0b1000..Select data slice [136:105]
 *  0b1111..Select data [136:0]
 */
#define MSF1_B_test_R_ADR_CTRL_GRPSEL(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_ADR_CTRL_GRPSEL_SHIFT)) & MSF1_B_test_R_ADR_CTRL_GRPSEL_MASK)

#define MSF1_B_test_R_ADR_CTRL_XADR_MASK         (0xFFF0U)
#define MSF1_B_test_R_ADR_CTRL_XADR_SHIFT        (4U)
/*! XADR - BIST XADR */
#define MSF1_B_test_R_ADR_CTRL_XADR(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_ADR_CTRL_XADR_SHIFT)) & MSF1_B_test_R_ADR_CTRL_XADR_MASK)

#define MSF1_B_test_R_ADR_CTRL_YADR_MASK         (0x1F0000U)
#define MSF1_B_test_R_ADR_CTRL_YADR_SHIFT        (16U)
/*! YADR - BIST YADR */
#define MSF1_B_test_R_ADR_CTRL_YADR(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_ADR_CTRL_YADR_SHIFT)) & MSF1_B_test_R_ADR_CTRL_YADR_MASK)

#define MSF1_B_test_R_ADR_CTRL_PROG_ATTR_MASK    (0xE00000U)
#define MSF1_B_test_R_ADR_CTRL_PROG_ATTR_SHIFT   (21U)
/*! PROG_ATTR - Program Attribute
 *  0b000..One YE pulse will program one data slice group
 *  0b001..One YE pulse will program two data slice groups
 *  0b010..One YE pulse will program three data slice groups (reserved)
 *  0b011..One YE pulse will program four data slice groups
 *  0b100..One YE pulse will program five data slice groups (reserved)
 *  0b101..One YE pulse will program six data slice groups (reserved)
 *  0b110..One YE pulse will program seven data slice groups (reserved)
 *  0b111..One YE pulse will program eight data slice groups (reserved)
 */
#define MSF1_B_test_R_ADR_CTRL_PROG_ATTR(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_ADR_CTRL_PROG_ATTR_SHIFT)) & MSF1_B_test_R_ADR_CTRL_PROG_ATTR_MASK)
/*! @} */

/*! @name R_DATA_CTRL0 - BIST Data Control 0 Register */
/*! @{ */

#define MSF1_B_test_R_DATA_CTRL0_DATA0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_R_DATA_CTRL0_DATA0_SHIFT     (0U)
/*! DATA0 - BIST Data 0 Low */
#define MSF1_B_test_R_DATA_CTRL0_DATA0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DATA_CTRL0_DATA0_SHIFT)) & MSF1_B_test_R_DATA_CTRL0_DATA0_MASK)
/*! @} */

/*! @name R_PIN_CTRL - BIST Pin Control Register */
/*! @{ */

#define MSF1_B_test_R_PIN_CTRL_MAS1_MASK         (0x1U)
#define MSF1_B_test_R_PIN_CTRL_MAS1_SHIFT        (0U)
/*! MAS1 - Mass Erase */
#define MSF1_B_test_R_PIN_CTRL_MAS1(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_MAS1_SHIFT)) & MSF1_B_test_R_PIN_CTRL_MAS1_MASK)

#define MSF1_B_test_R_PIN_CTRL_IFREN_MASK        (0x2U)
#define MSF1_B_test_R_PIN_CTRL_IFREN_SHIFT       (1U)
/*! IFREN - IFR Enable */
#define MSF1_B_test_R_PIN_CTRL_IFREN(x)          (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_IFREN_SHIFT)) & MSF1_B_test_R_PIN_CTRL_IFREN_MASK)

#define MSF1_B_test_R_PIN_CTRL_IFREN1_MASK       (0x4U)
#define MSF1_B_test_R_PIN_CTRL_IFREN1_SHIFT      (2U)
/*! IFREN1 - IFR1 Enable */
#define MSF1_B_test_R_PIN_CTRL_IFREN1(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_IFREN1_SHIFT)) & MSF1_B_test_R_PIN_CTRL_IFREN1_MASK)

#define MSF1_B_test_R_PIN_CTRL_REDEN_MASK        (0x8U)
#define MSF1_B_test_R_PIN_CTRL_REDEN_SHIFT       (3U)
/*! REDEN - Redundancy Block Enable */
#define MSF1_B_test_R_PIN_CTRL_REDEN(x)          (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_REDEN_SHIFT)) & MSF1_B_test_R_PIN_CTRL_REDEN_MASK)

#define MSF1_B_test_R_PIN_CTRL_LVE_MASK          (0x10U)
#define MSF1_B_test_R_PIN_CTRL_LVE_SHIFT         (4U)
/*! LVE - Low Voltage Enable */
#define MSF1_B_test_R_PIN_CTRL_LVE(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_LVE_SHIFT)) & MSF1_B_test_R_PIN_CTRL_LVE_MASK)

#define MSF1_B_test_R_PIN_CTRL_PV_MASK           (0x20U)
#define MSF1_B_test_R_PIN_CTRL_PV_SHIFT          (5U)
/*! PV - Program Verify Enable */
#define MSF1_B_test_R_PIN_CTRL_PV(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_PV_SHIFT)) & MSF1_B_test_R_PIN_CTRL_PV_MASK)

#define MSF1_B_test_R_PIN_CTRL_EV_MASK           (0x40U)
#define MSF1_B_test_R_PIN_CTRL_EV_SHIFT          (6U)
/*! EV - Erase Verify Enable */
#define MSF1_B_test_R_PIN_CTRL_EV(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_EV_SHIFT)) & MSF1_B_test_R_PIN_CTRL_EV_MASK)

#define MSF1_B_test_R_PIN_CTRL_WIPGM_MASK        (0x180U)
#define MSF1_B_test_R_PIN_CTRL_WIPGM_SHIFT       (7U)
/*! WIPGM - Program Current */
#define MSF1_B_test_R_PIN_CTRL_WIPGM(x)          (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_WIPGM_SHIFT)) & MSF1_B_test_R_PIN_CTRL_WIPGM_MASK)

#define MSF1_B_test_R_PIN_CTRL_WHV_MASK          (0x1E00U)
#define MSF1_B_test_R_PIN_CTRL_WHV_SHIFT         (9U)
/*! WHV - High Voltage Level */
#define MSF1_B_test_R_PIN_CTRL_WHV(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_WHV_SHIFT)) & MSF1_B_test_R_PIN_CTRL_WHV_MASK)

#define MSF1_B_test_R_PIN_CTRL_WMV_MASK          (0xE000U)
#define MSF1_B_test_R_PIN_CTRL_WMV_SHIFT         (13U)
/*! WMV - Medium Voltage Level */
#define MSF1_B_test_R_PIN_CTRL_WMV(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_WMV_SHIFT)) & MSF1_B_test_R_PIN_CTRL_WMV_MASK)

#define MSF1_B_test_R_PIN_CTRL_XE_MASK           (0x10000U)
#define MSF1_B_test_R_PIN_CTRL_XE_SHIFT          (16U)
/*! XE - X Address Enable */
#define MSF1_B_test_R_PIN_CTRL_XE(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_XE_SHIFT)) & MSF1_B_test_R_PIN_CTRL_XE_MASK)

#define MSF1_B_test_R_PIN_CTRL_YE_MASK           (0x20000U)
#define MSF1_B_test_R_PIN_CTRL_YE_SHIFT          (17U)
/*! YE - Y Address Enable */
#define MSF1_B_test_R_PIN_CTRL_YE(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_YE_SHIFT)) & MSF1_B_test_R_PIN_CTRL_YE_MASK)

#define MSF1_B_test_R_PIN_CTRL_SE_MASK           (0x40000U)
#define MSF1_B_test_R_PIN_CTRL_SE_SHIFT          (18U)
/*! SE - Sense Amp Enable */
#define MSF1_B_test_R_PIN_CTRL_SE(x)             (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_SE_SHIFT)) & MSF1_B_test_R_PIN_CTRL_SE_MASK)

#define MSF1_B_test_R_PIN_CTRL_ERASE_MASK        (0x80000U)
#define MSF1_B_test_R_PIN_CTRL_ERASE_SHIFT       (19U)
/*! ERASE - Erase Mode */
#define MSF1_B_test_R_PIN_CTRL_ERASE(x)          (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_ERASE_SHIFT)) & MSF1_B_test_R_PIN_CTRL_ERASE_MASK)

