zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_R_PIN_CTRL_PROG_MASK         (0x100000U)
#define MSF1_B_test_R_PIN_CTRL_PROG_SHIFT        (20U)
/*! PROG - Program Mode */
#define MSF1_B_test_R_PIN_CTRL_PROG(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_PROG_SHIFT)) & MSF1_B_test_R_PIN_CTRL_PROG_MASK)

#define MSF1_B_test_R_PIN_CTRL_NVSTR_MASK        (0x200000U)
#define MSF1_B_test_R_PIN_CTRL_NVSTR_SHIFT       (21U)
/*! NVSTR - NVM Store */
#define MSF1_B_test_R_PIN_CTRL_NVSTR(x)          (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_NVSTR_SHIFT)) & MSF1_B_test_R_PIN_CTRL_NVSTR_MASK)

#define MSF1_B_test_R_PIN_CTRL_SLM_MASK          (0x400000U)
#define MSF1_B_test_R_PIN_CTRL_SLM_SHIFT         (22U)
/*! SLM - Sleep Mode Enable */
#define MSF1_B_test_R_PIN_CTRL_SLM(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_SLM_SHIFT)) & MSF1_B_test_R_PIN_CTRL_SLM_MASK)

#define MSF1_B_test_R_PIN_CTRL_RECALL_MASK       (0x800000U)
#define MSF1_B_test_R_PIN_CTRL_RECALL_SHIFT      (23U)
/*! RECALL - Recall Trim Code */
#define MSF1_B_test_R_PIN_CTRL_RECALL(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_RECALL_SHIFT)) & MSF1_B_test_R_PIN_CTRL_RECALL_MASK)

#define MSF1_B_test_R_PIN_CTRL_HEM_MASK          (0x1000000U)
#define MSF1_B_test_R_PIN_CTRL_HEM_SHIFT         (24U)
/*! HEM - HEM Control */
#define MSF1_B_test_R_PIN_CTRL_HEM(x)            (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_PIN_CTRL_HEM_SHIFT)) & MSF1_B_test_R_PIN_CTRL_HEM_MASK)
/*! @} */

/*! @name R_CNT_LOOP_CTRL - BIST Loop Count Control Register */
/*! @{ */

#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPCNT_MASK (0xFFFU)
#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPCNT_SHIFT (0U)
/*! LOOPCNT - Loop Count Control */
#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPCNT(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_CNT_LOOP_CTRL_LOOPCNT_SHIFT)) & MSF1_B_test_R_CNT_LOOP_CTRL_LOOPCNT_MASK)

#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPOPT_MASK (0x7000U)
#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPOPT_SHIFT (12U)
/*! LOOPOPT - Loop Option
 *  0b000..Loop is disabled; selected BIST operation is run once
 *  0b001..Loop is enabled; XADR increments by 1 XADR increments by 1 for each new loop. Stops when total loop count meets LOOPCNT+1.
 *  0b010..Loop is enabled; YADR increments by 1 YADR increments by 1 for each new loop. Stops when total loop count meets LOOPCNT+1.
 *  0b011..Loop is enabled; XADR increments by 2 XADR increments by 2 for each new loop. Stops when total loop count meets LOOPCNT+1.
 *  0b100..Loop is enabled; XADR increments by sector XADR increments by 16 for each new loop. Stops when total loop count meets LOOPCNT+1.
 */
#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPOPT(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_CNT_LOOP_CTRL_LOOPOPT_SHIFT)) & MSF1_B_test_R_CNT_LOOP_CTRL_LOOPOPT_MASK)

#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPUNIT_MASK (0x38000U)
#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPUNIT_SHIFT (15U)
/*! LOOPUNIT - Loop Time Unit
 *  0b000..Clock cycles
 *  0b001..0.5 usec
 *  0b010..1 usec
 *  0b011..10 usec
 *  0b100..100 usec
 *  0b101..1 msec
 *  0b110..10 msec
 *  0b111..100 msec
 */
#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPUNIT(x)  (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_CNT_LOOP_CTRL_LOOPUNIT_SHIFT)) & MSF1_B_test_R_CNT_LOOP_CTRL_LOOPUNIT_MASK)

#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPDLY_MASK (0x1FC0000U)
#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPDLY_SHIFT (18U)
/*! LOOPDLY - Loop Time Delay Scalar */
#define MSF1_B_test_R_CNT_LOOP_CTRL_LOOPDLY(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_CNT_LOOP_CTRL_LOOPDLY_SHIFT)) & MSF1_B_test_R_CNT_LOOP_CTRL_LOOPDLY_MASK)
/*! @} */

/*! @name R_TIMER_CTRL - BIST Timer Control Register */
/*! @{ */

#define MSF1_B_test_R_TIMER_CTRL_TNVSUNIT_MASK   (0x7U)
#define MSF1_B_test_R_TIMER_CTRL_TNVSUNIT_SHIFT  (0U)
/*! TNVSUNIT - Tnvs Time Unit
 *  0b000..Clock cycles
 *  0b001..0.5 usec
 *  0b010..1 usec
 *  0b011..10 usec
 *  0b100..100 usec
 *  0b101..1 msec
 *  0b110..10 msec
 *  0b111..100 msec
 */
#define MSF1_B_test_R_TIMER_CTRL_TNVSUNIT(x)     (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TIMER_CTRL_TNVSUNIT_SHIFT)) & MSF1_B_test_R_TIMER_CTRL_TNVSUNIT_MASK)

#define MSF1_B_test_R_TIMER_CTRL_TNVSDLY_MASK    (0x78U)
#define MSF1_B_test_R_TIMER_CTRL_TNVSDLY_SHIFT   (3U)
/*! TNVSDLY - Tnvs Time Delay Scalar */
#define MSF1_B_test_R_TIMER_CTRL_TNVSDLY(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TIMER_CTRL_TNVSDLY_SHIFT)) & MSF1_B_test_R_TIMER_CTRL_TNVSDLY_MASK)

#define MSF1_B_test_R_TIMER_CTRL_TNVHUNIT_MASK   (0x380U)
#define MSF1_B_test_R_TIMER_CTRL_TNVHUNIT_SHIFT  (7U)
/*! TNVHUNIT - Tnvh Time Unit
 *  0b000..Clock cycles
 *  0b001..0.5 usec
 *  0b010..1 usec
 *  0b011..10 usec
 *  0b100..100 usec
 *  0b101..1 msec
 *  0b110..10 msec
 *  0b111..100 msec
 */
#define MSF1_B_test_R_TIMER_CTRL_TNVHUNIT(x)     (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TIMER_CTRL_TNVHUNIT_SHIFT)) & MSF1_B_test_R_TIMER_CTRL_TNVHUNIT_MASK)

#define MSF1_B_test_R_TIMER_CTRL_TNVHDLY_MASK    (0x3C00U)
#define MSF1_B_test_R_TIMER_CTRL_TNVHDLY_SHIFT   (10U)
/*! TNVHDLY - Tnvh Time Delay Scalar */
#define MSF1_B_test_R_TIMER_CTRL_TNVHDLY(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TIMER_CTRL_TNVHDLY_SHIFT)) & MSF1_B_test_R_TIMER_CTRL_TNVHDLY_MASK)

#define MSF1_B_test_R_TIMER_CTRL_TPGSUNIT_MASK   (0x1C000U)
#define MSF1_B_test_R_TIMER_CTRL_TPGSUNIT_SHIFT  (14U)
/*! TPGSUNIT - Tpgs Time Unit
 *  0b000..Clock cycles
 *  0b001..0.5 usec
 *  0b010..1 usec
 *  0b011..10 usec
 *  0b100..100 usec
 *  0b101..1 msec
 *  0b110..10 msec
 *  0b111..100 msec
 */
#define MSF1_B_test_R_TIMER_CTRL_TPGSUNIT(x)     (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TIMER_CTRL_TPGSUNIT_SHIFT)) & MSF1_B_test_R_TIMER_CTRL_TPGSUNIT_MASK)

#define MSF1_B_test_R_TIMER_CTRL_TPGSDLY_MASK    (0x1E0000U)
#define MSF1_B_test_R_TIMER_CTRL_TPGSDLY_SHIFT   (17U)
/*! TPGSDLY - Tpgs Time Delay Scalar */
#define MSF1_B_test_R_TIMER_CTRL_TPGSDLY(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TIMER_CTRL_TPGSDLY_SHIFT)) & MSF1_B_test_R_TIMER_CTRL_TPGSDLY_MASK)

#define MSF1_B_test_R_TIMER_CTRL_TRCVUNIT_MASK   (0xE00000U)
#define MSF1_B_test_R_TIMER_CTRL_TRCVUNIT_SHIFT  (21U)
/*! TRCVUNIT - Trcv Time Unit
 *  0b000..Clock cycles
 *  0b001..0.5 usec
 *  0b010..1 usec
 *  0b011..10 usec
 *  0b100..100 usec
 *  0b101..1 msec
 *  0b110..10 msec
 *  0b111..100 msec
 */
#define MSF1_B_test_R_TIMER_CTRL_TRCVUNIT(x)     (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TIMER_CTRL_TRCVUNIT_SHIFT)) & MSF1_B_test_R_TIMER_CTRL_TRCVUNIT_MASK)

#define MSF1_B_test_R_TIMER_CTRL_TRCVDLY_MASK    (0xF000000U)
#define MSF1_B_test_R_TIMER_CTRL_TRCVDLY_SHIFT   (24U)
/*! TRCVDLY - Trcv Time Delay Scalar */
#define MSF1_B_test_R_TIMER_CTRL_TRCVDLY(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TIMER_CTRL_TRCVDLY_SHIFT)) & MSF1_B_test_R_TIMER_CTRL_TRCVDLY_MASK)

