zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_R_TIMER_CTRL_TLVSUNIT_MASK   (0x70000000U)
#define MSF1_B_test_R_TIMER_CTRL_TLVSUNIT_SHIFT  (28U)
/*! TLVSUNIT - Tlvs Time Unit
 *  0b000..Clock cycles
 *  0b001..0.5 usec
 *  0b010..1 usec
 *  0b011..10 usec
 *  0b100..100 usec
 *  0b101..1 msec
 *  0b110..10 msec
 *  0b111..100 msec
 */
#define MSF1_B_test_R_TIMER_CTRL_TLVSUNIT(x)     (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TIMER_CTRL_TLVSUNIT_SHIFT)) & MSF1_B_test_R_TIMER_CTRL_TLVSUNIT_MASK)

#define MSF1_B_test_R_TIMER_CTRL_TLVSDLY_L_MASK  (0x80000000U)
#define MSF1_B_test_R_TIMER_CTRL_TLVSDLY_L_SHIFT (31U)
/*! TLVSDLY_L - Tlvs Time Delay Scalar Low */
#define MSF1_B_test_R_TIMER_CTRL_TLVSDLY_L(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TIMER_CTRL_TLVSDLY_L_SHIFT)) & MSF1_B_test_R_TIMER_CTRL_TLVSDLY_L_MASK)
/*! @} */

/*! @name R_TEST_CTRL - BIST Test Control Register */
/*! @{ */

#define MSF1_B_test_R_TEST_CTRL_BUSY_MASK        (0x1U)
#define MSF1_B_test_R_TEST_CTRL_BUSY_SHIFT       (0U)
/*! BUSY - BIST Busy Status
 *  0b0..BIST is idle
 *  0b1..BIST is busy
 */
#define MSF1_B_test_R_TEST_CTRL_BUSY(x)          (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TEST_CTRL_BUSY_SHIFT)) & MSF1_B_test_R_TEST_CTRL_BUSY_MASK)

#define MSF1_B_test_R_TEST_CTRL_DEBUG_MASK       (0x2U)
#define MSF1_B_test_R_TEST_CTRL_DEBUG_SHIFT      (1U)
/*! DEBUG - BIST Debug Status */
#define MSF1_B_test_R_TEST_CTRL_DEBUG(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TEST_CTRL_DEBUG_SHIFT)) & MSF1_B_test_R_TEST_CTRL_DEBUG_MASK)

#define MSF1_B_test_R_TEST_CTRL_STATUS0_MASK     (0x4U)
#define MSF1_B_test_R_TEST_CTRL_STATUS0_SHIFT    (2U)
/*! STATUS0 - BIST Status 0
 *  0b0..BIST test passed on flash block 0
 *  0b1..BIST test failed on flash block 0
 */
#define MSF1_B_test_R_TEST_CTRL_STATUS0(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TEST_CTRL_STATUS0_SHIFT)) & MSF1_B_test_R_TEST_CTRL_STATUS0_MASK)

#define MSF1_B_test_R_TEST_CTRL_STATUS1_MASK     (0x8U)
#define MSF1_B_test_R_TEST_CTRL_STATUS1_SHIFT    (3U)
/*! STATUS1 - BIST status 1
 *  0b0..BIST test passed on flash block 1
 *  0b1..BIST test failed on flash block 1
 */
#define MSF1_B_test_R_TEST_CTRL_STATUS1(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TEST_CTRL_STATUS1_SHIFT)) & MSF1_B_test_R_TEST_CTRL_STATUS1_MASK)

#define MSF1_B_test_R_TEST_CTRL_DEBUGRUN_MASK    (0x10U)
#define MSF1_B_test_R_TEST_CTRL_DEBUGRUN_SHIFT   (4U)
/*! DEBUGRUN - BIST Continue Debug Run */
#define MSF1_B_test_R_TEST_CTRL_DEBUGRUN(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TEST_CTRL_DEBUGRUN_SHIFT)) & MSF1_B_test_R_TEST_CTRL_DEBUGRUN_MASK)

#define MSF1_B_test_R_TEST_CTRL_STARTRUN_MASK    (0x20U)
#define MSF1_B_test_R_TEST_CTRL_STARTRUN_SHIFT   (5U)
/*! STARTRUN - Run New BIST Operation */
#define MSF1_B_test_R_TEST_CTRL_STARTRUN(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TEST_CTRL_STARTRUN_SHIFT)) & MSF1_B_test_R_TEST_CTRL_STARTRUN_MASK)

#define MSF1_B_test_R_TEST_CTRL_CMDINDEX_MASK    (0xFFC0U)
#define MSF1_B_test_R_TEST_CTRL_CMDINDEX_SHIFT   (6U)
/*! CMDINDEX - BIST Command Index (code) */
#define MSF1_B_test_R_TEST_CTRL_CMDINDEX(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TEST_CTRL_CMDINDEX_SHIFT)) & MSF1_B_test_R_TEST_CTRL_CMDINDEX_MASK)

#define MSF1_B_test_R_TEST_CTRL_DISABLE_IP1_MASK (0x10000U)
#define MSF1_B_test_R_TEST_CTRL_DISABLE_IP1_SHIFT (16U)
/*! DISABLE_IP1 - BIST Disable IP1 */
#define MSF1_B_test_R_TEST_CTRL_DISABLE_IP1(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TEST_CTRL_DISABLE_IP1_SHIFT)) & MSF1_B_test_R_TEST_CTRL_DISABLE_IP1_MASK)
/*! @} */

/*! @name R_ABORT_LOOP - BIST Abort Loop Register */
/*! @{ */

#define MSF1_B_test_R_ABORT_LOOP_ABORT_LOOP_MASK (0x1U)
#define MSF1_B_test_R_ABORT_LOOP_ABORT_LOOP_SHIFT (0U)
/*! ABORT_LOOP - Abort Loop
 *  0b0..No effect
 *  0b1..Abort BIST loop commands and force the loop counter to return to 0x0
 */
#define MSF1_B_test_R_ABORT_LOOP_ABORT_LOOP(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_ABORT_LOOP_ABORT_LOOP_SHIFT)) & MSF1_B_test_R_ABORT_LOOP_ABORT_LOOP_MASK)
/*! @} */

/*! @name R_ADR_QUERY - BIST Address Query Register */
/*! @{ */

#define MSF1_B_test_R_ADR_QUERY_YADRFAIL_MASK    (0x1FU)
#define MSF1_B_test_R_ADR_QUERY_YADRFAIL_SHIFT   (0U)
/*! YADRFAIL - Failing YADR */
#define MSF1_B_test_R_ADR_QUERY_YADRFAIL(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_ADR_QUERY_YADRFAIL_SHIFT)) & MSF1_B_test_R_ADR_QUERY_YADRFAIL_MASK)

#define MSF1_B_test_R_ADR_QUERY_XADRFAIL_MASK    (0x1FFE0U)
#define MSF1_B_test_R_ADR_QUERY_XADRFAIL_SHIFT   (5U)
/*! XADRFAIL - Failing XADR */
#define MSF1_B_test_R_ADR_QUERY_XADRFAIL(x)      (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_ADR_QUERY_XADRFAIL_SHIFT)) & MSF1_B_test_R_ADR_QUERY_XADRFAIL_MASK)
/*! @} */

/*! @name R_DOUT_QUERY0 - BIST DOUT Query 0 Register */
/*! @{ */

#define MSF1_B_test_R_DOUT_QUERY0_DOUTFAIL_MASK  (0xFFFFFFFFU)
#define MSF1_B_test_R_DOUT_QUERY0_DOUTFAIL_SHIFT (0U)
/*! DOUTFAIL - Failing DOUT Low */
#define MSF1_B_test_R_DOUT_QUERY0_DOUTFAIL(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DOUT_QUERY0_DOUTFAIL_SHIFT)) & MSF1_B_test_R_DOUT_QUERY0_DOUTFAIL_MASK)
/*! @} */

/*! @name R_SMW_QUERY - BIST SMW Query Register */
/*! @{ */

#define MSF1_B_test_R_SMW_QUERY_SMWLOOP_MASK     (0x3FFU)
#define MSF1_B_test_R_SMW_QUERY_SMWLOOP_SHIFT    (0U)
/*! SMWLOOP - SMW Total Loop Count */
#define MSF1_B_test_R_SMW_QUERY_SMWLOOP(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_SMW_QUERY_SMWLOOP_SHIFT)) & MSF1_B_test_R_SMW_QUERY_SMWLOOP_MASK)

#define MSF1_B_test_R_SMW_QUERY_SMWLAST_MASK     (0x7FC00U)
#define MSF1_B_test_R_SMW_QUERY_SMWLAST_SHIFT    (10U)
/*! SMWLAST - SMW Last Voltage Setting */
#define MSF1_B_test_R_SMW_QUERY_SMWLAST(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_SMW_QUERY_SMWLAST_SHIFT)) & MSF1_B_test_R_SMW_QUERY_SMWLAST_MASK)
/*! @} */

/*! @name R_SMW_SETTING0 - BIST SMW Setting 0 Register */
/*! @{ */

#define MSF1_B_test_R_SMW_SETTING0_SMWPARM0_MASK (0x7FFFFFFFU)
#define MSF1_B_test_R_SMW_SETTING0_SMWPARM0_SHIFT (0U)
/*! SMWPARM0 - SMW Parameter Set 0 */
#define MSF1_B_test_R_SMW_SETTING0_SMWPARM0(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_SMW_SETTING0_SMWPARM0_SHIFT)) & MSF1_B_test_R_SMW_SETTING0_SMWPARM0_MASK)
/*! @} */

/*! @name R_SMW_SETTING1 - BIST SMW Setting 1 Register */
/*! @{ */

