zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_R_SMW_SETTING1_SMWPARM1_MASK (0xFFFFFFFU)
#define MSF1_B_test_R_SMW_SETTING1_SMWPARM1_SHIFT (0U)
/*! SMWPARM1 - SMW Parameter Set 1 */
#define MSF1_B_test_R_SMW_SETTING1_SMWPARM1(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_SMW_SETTING1_SMWPARM1_SHIFT)) & MSF1_B_test_R_SMW_SETTING1_SMWPARM1_MASK)
/*! @} */

/*! @name R_SMP_WHV0 - BIST SMP WHV Setting 0 Register */
/*! @{ */

#define MSF1_B_test_R_SMP_WHV0_SMPWHV0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_R_SMP_WHV0_SMPWHV0_SHIFT     (0U)
/*! SMPWHV0 - SMP WHV Parameter Set 0 */
#define MSF1_B_test_R_SMP_WHV0_SMPWHV0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_SMP_WHV0_SMPWHV0_SHIFT)) & MSF1_B_test_R_SMP_WHV0_SMPWHV0_MASK)
/*! @} */

/*! @name R_SMP_WHV1 - BIST SMP WHV Setting 1 Register */
/*! @{ */

#define MSF1_B_test_R_SMP_WHV1_SMPWHV1_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_R_SMP_WHV1_SMPWHV1_SHIFT     (0U)
/*! SMPWHV1 - SMP WHV Parameter Set 1 */
#define MSF1_B_test_R_SMP_WHV1_SMPWHV1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_SMP_WHV1_SMPWHV1_SHIFT)) & MSF1_B_test_R_SMP_WHV1_SMPWHV1_MASK)
/*! @} */

/*! @name R_SME_WHV0 - BIST SME WHV Setting 0 Register */
/*! @{ */

#define MSF1_B_test_R_SME_WHV0_SMEWHV0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_R_SME_WHV0_SMEWHV0_SHIFT     (0U)
/*! SMEWHV0 - SME WHV Parameter Set 0 */
#define MSF1_B_test_R_SME_WHV0_SMEWHV0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_SME_WHV0_SMEWHV0_SHIFT)) & MSF1_B_test_R_SME_WHV0_SMEWHV0_MASK)
/*! @} */

/*! @name R_SME_WHV1 - BIST SME WHV Setting 1 Register */
/*! @{ */

#define MSF1_B_test_R_SME_WHV1_SMEWHV1_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_R_SME_WHV1_SMEWHV1_SHIFT     (0U)
/*! SMEWHV1 - SME WHV Parameter Set 1 */
#define MSF1_B_test_R_SME_WHV1_SMEWHV1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_SME_WHV1_SMEWHV1_SHIFT)) & MSF1_B_test_R_SME_WHV1_SMEWHV1_MASK)
/*! @} */

/*! @name R_SMW_SETTING2 - BIST SMW Setting 2 Register */
/*! @{ */

#define MSF1_B_test_R_SMW_SETTING2_SMWPARM2_MASK (0x1FFFFFFFU)
#define MSF1_B_test_R_SMW_SETTING2_SMWPARM2_SHIFT (0U)
/*! SMWPARM2 - SMW Parameter Set 2 */
#define MSF1_B_test_R_SMW_SETTING2_SMWPARM2(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_SMW_SETTING2_SMWPARM2_SHIFT)) & MSF1_B_test_R_SMW_SETTING2_SMWPARM2_MASK)
/*! @} */

/*! @name R_D_MISR0 - BIST DIN MISR 0 Register */
/*! @{ */

#define MSF1_B_test_R_D_MISR0_DATASIG0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_R_D_MISR0_DATASIG0_SHIFT     (0U)
/*! DATASIG0 - Data Signature */
#define MSF1_B_test_R_D_MISR0_DATASIG0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_D_MISR0_DATASIG0_SHIFT)) & MSF1_B_test_R_D_MISR0_DATASIG0_MASK)
/*! @} */

/*! @name R_A_MISR0 - BIST Address MISR 0 Register */
/*! @{ */

#define MSF1_B_test_R_A_MISR0_ADRSIG0_MASK       (0xFFFFFFFFU)
#define MSF1_B_test_R_A_MISR0_ADRSIG0_SHIFT      (0U)
/*! ADRSIG0 - Address Signature */
#define MSF1_B_test_R_A_MISR0_ADRSIG0(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_A_MISR0_ADRSIG0_SHIFT)) & MSF1_B_test_R_A_MISR0_ADRSIG0_MASK)
/*! @} */

/*! @name R_C_MISR0 - BIST Control MISR 0 Register */
/*! @{ */

#define MSF1_B_test_R_C_MISR0_CTRLSIG0_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_R_C_MISR0_CTRLSIG0_SHIFT     (0U)
/*! CTRLSIG0 - Control Signature */
#define MSF1_B_test_R_C_MISR0_CTRLSIG0(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_C_MISR0_CTRLSIG0_SHIFT)) & MSF1_B_test_R_C_MISR0_CTRLSIG0_MASK)
/*! @} */

/*! @name R_SMW_SETTING3 - BIST SMW Setting 3 Register */
/*! @{ */

#define MSF1_B_test_R_SMW_SETTING3_SMWPARM3_MASK (0x1FFFFU)
#define MSF1_B_test_R_SMW_SETTING3_SMWPARM3_SHIFT (0U)
/*! SMWPARM3 - SMW Parameter Set 3 */
#define MSF1_B_test_R_SMW_SETTING3_SMWPARM3(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_SMW_SETTING3_SMWPARM3_SHIFT)) & MSF1_B_test_R_SMW_SETTING3_SMWPARM3_MASK)
/*! @} */

/*! @name R_DATA_CTRL1 - BIST Data Control 1 Register */
/*! @{ */

#define MSF1_B_test_R_DATA_CTRL1_DATA1_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_R_DATA_CTRL1_DATA1_SHIFT     (0U)
/*! DATA1 - BIST Data 1 Low */
#define MSF1_B_test_R_DATA_CTRL1_DATA1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DATA_CTRL1_DATA1_SHIFT)) & MSF1_B_test_R_DATA_CTRL1_DATA1_MASK)
/*! @} */

/*! @name R_DATA_CTRL2 - BIST Data Control 2 Register */
/*! @{ */

#define MSF1_B_test_R_DATA_CTRL2_DATA2_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_R_DATA_CTRL2_DATA2_SHIFT     (0U)
/*! DATA2 - BIST Data 2 Low */
#define MSF1_B_test_R_DATA_CTRL2_DATA2(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DATA_CTRL2_DATA2_SHIFT)) & MSF1_B_test_R_DATA_CTRL2_DATA2_MASK)
/*! @} */

/*! @name R_DATA_CTRL3 - BIST Data Control 3 Register */
/*! @{ */

#define MSF1_B_test_R_DATA_CTRL3_DATA3_MASK      (0xFFFFFFFFU)
#define MSF1_B_test_R_DATA_CTRL3_DATA3_SHIFT     (0U)
/*! DATA3 - BIST Data 3 Low */
#define MSF1_B_test_R_DATA_CTRL3_DATA3(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DATA_CTRL3_DATA3_SHIFT)) & MSF1_B_test_R_DATA_CTRL3_DATA3_MASK)
/*! @} */

/*! @name R_REPAIR0_0 - BIST Repair 0 for Block 0 Register */
/*! @{ */

#define MSF1_B_test_R_REPAIR0_0_RDIS0_0_MASK     (0x1U)
#define MSF1_B_test_R_REPAIR0_0_RDIS0_0_SHIFT    (0U)
/*! RDIS0_0 - Control Repair 0 in Block 0.
 *  0b0..Repair address is valid
 *  0b1..Repair address is not valid
 */
#define MSF1_B_test_R_REPAIR0_0_RDIS0_0(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_REPAIR0_0_RDIS0_0_SHIFT)) & MSF1_B_test_R_REPAIR0_0_RDIS0_0_MASK)

#define MSF1_B_test_R_REPAIR0_0_RADR0_0_MASK     (0x1FEU)
#define MSF1_B_test_R_REPAIR0_0_RADR0_0_SHIFT    (1U)
/*! RADR0_0 - XADR for Repair 0 in Block 0 */
#define MSF1_B_test_R_REPAIR0_0_RADR0_0(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_REPAIR0_0_RADR0_0_SHIFT)) & MSF1_B_test_R_REPAIR0_0_RADR0_0_MASK)
/*! @} */

/*! @name R_REPAIR0_1 - BIST Repair 1 Block 0 Register */
/*! @{ */

#define MSF1_B_test_R_REPAIR0_1_RDIS0_1_MASK     (0x1U)
#define MSF1_B_test_R_REPAIR0_1_RDIS0_1_SHIFT    (0U)
/*! RDIS0_1 - Control Repair 1 in Block 0.
 *  0b0..Repair address is valid
 *  0b1..Repair address is not valid
 */
#define MSF1_B_test_R_REPAIR0_1_RDIS0_1(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_REPAIR0_1_RDIS0_1_SHIFT)) & MSF1_B_test_R_REPAIR0_1_RDIS0_1_MASK)

