zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_R_REPAIR0_1_RADR0_1_MASK     (0x1FEU)
#define MSF1_B_test_R_REPAIR0_1_RADR0_1_SHIFT    (1U)
/*! RADR0_1 - XADR for Repair 1 in Block 0. */
#define MSF1_B_test_R_REPAIR0_1_RADR0_1(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_REPAIR0_1_RADR0_1_SHIFT)) & MSF1_B_test_R_REPAIR0_1_RADR0_1_MASK)
/*! @} */

/*! @name R_REPAIR1_0 - BIST Repair 0 Block 1 Register */
/*! @{ */

#define MSF1_B_test_R_REPAIR1_0_RDIS1_0_MASK     (0x1U)
#define MSF1_B_test_R_REPAIR1_0_RDIS1_0_SHIFT    (0U)
/*! RDIS1_0 - Control Repair 0 in Block 1.
 *  0b0..Repair address is valid
 *  0b1..Repair address is not valid
 */
#define MSF1_B_test_R_REPAIR1_0_RDIS1_0(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_REPAIR1_0_RDIS1_0_SHIFT)) & MSF1_B_test_R_REPAIR1_0_RDIS1_0_MASK)

#define MSF1_B_test_R_REPAIR1_0_RADR1_0_MASK     (0x1FEU)
#define MSF1_B_test_R_REPAIR1_0_RADR1_0_SHIFT    (1U)
/*! RADR1_0 - XADR for Repair 0 in Block 1. */
#define MSF1_B_test_R_REPAIR1_0_RADR1_0(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_REPAIR1_0_RADR1_0_SHIFT)) & MSF1_B_test_R_REPAIR1_0_RADR1_0_MASK)
/*! @} */

/*! @name R_REPAIR1_1 - BIST Repair 1 Block 1 Register */
/*! @{ */

#define MSF1_B_test_R_REPAIR1_1_RDIS1_1_MASK     (0x1U)
#define MSF1_B_test_R_REPAIR1_1_RDIS1_1_SHIFT    (0U)
/*! RDIS1_1 - Control Repair 1 in Block 1.
 *  0b0..Repair address is valid
 *  0b1..Repair address is not valid
 */
#define MSF1_B_test_R_REPAIR1_1_RDIS1_1(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_REPAIR1_1_RDIS1_1_SHIFT)) & MSF1_B_test_R_REPAIR1_1_RDIS1_1_MASK)

#define MSF1_B_test_R_REPAIR1_1_RADR1_1_MASK     (0x1FEU)
#define MSF1_B_test_R_REPAIR1_1_RADR1_1_SHIFT    (1U)
/*! RADR1_1 - XADR for Repair 1 in Block 1. */
#define MSF1_B_test_R_REPAIR1_1_RADR1_1(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_REPAIR1_1_RADR1_1_SHIFT)) & MSF1_B_test_R_REPAIR1_1_RADR1_1_MASK)
/*! @} */

/*! @name R_DATA_CTRL0_EX - BIST Data Control 0 Extension Register */
/*! @{ */

#define MSF1_B_test_R_DATA_CTRL0_EX_DATA0X_MASK  (0x7U)
#define MSF1_B_test_R_DATA_CTRL0_EX_DATA0X_SHIFT (0U)
/*! DATA0X - BIST Data 0 High */
#define MSF1_B_test_R_DATA_CTRL0_EX_DATA0X(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DATA_CTRL0_EX_DATA0X_SHIFT)) & MSF1_B_test_R_DATA_CTRL0_EX_DATA0X_MASK)
/*! @} */

/*! @name R_TIMER_CTRL_EX - BIST Timer Control Extension Register */
/*! @{ */

#define MSF1_B_test_R_TIMER_CTRL_EX_TLVSDLY_H_MASK (0x7U)
#define MSF1_B_test_R_TIMER_CTRL_EX_TLVSDLY_H_SHIFT (0U)
/*! TLVSDLY_H - Tlvs Time Delay Scalar High */
#define MSF1_B_test_R_TIMER_CTRL_EX_TLVSDLY_H(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_TIMER_CTRL_EX_TLVSDLY_H_SHIFT)) & MSF1_B_test_R_TIMER_CTRL_EX_TLVSDLY_H_MASK)
/*! @} */

/*! @name R_DOUT_QUERY1 - BIST DOUT Query 1 Register */
/*! @{ */

#define MSF1_B_test_R_DOUT_QUERY1_DOUT_MASK      (0x7U)
#define MSF1_B_test_R_DOUT_QUERY1_DOUT_SHIFT     (0U)
/*! DOUT - Failing DOUT High */
#define MSF1_B_test_R_DOUT_QUERY1_DOUT(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DOUT_QUERY1_DOUT_SHIFT)) & MSF1_B_test_R_DOUT_QUERY1_DOUT_MASK)
/*! @} */

/*! @name R_D_MISR1 - BIST DIN MISR 1 Register */
/*! @{ */

#define MSF1_B_test_R_D_MISR1_DATASIG1_MASK      (0xFFU)
#define MSF1_B_test_R_D_MISR1_DATASIG1_SHIFT     (0U)
/*! DATASIG1 - MISR Data Signature High */
#define MSF1_B_test_R_D_MISR1_DATASIG1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_D_MISR1_DATASIG1_SHIFT)) & MSF1_B_test_R_D_MISR1_DATASIG1_MASK)
/*! @} */

/*! @name R_A_MISR1 - BIST Address MISR 1 Register */
/*! @{ */

#define MSF1_B_test_R_A_MISR1_ADRSIG1_MASK       (0xFFU)
#define MSF1_B_test_R_A_MISR1_ADRSIG1_SHIFT      (0U)
/*! ADRSIG1 - MISR Address Signature High */
#define MSF1_B_test_R_A_MISR1_ADRSIG1(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_A_MISR1_ADRSIG1_SHIFT)) & MSF1_B_test_R_A_MISR1_ADRSIG1_MASK)
/*! @} */

/*! @name R_C_MISR1 - BIST Control MISR 1 Register */
/*! @{ */

#define MSF1_B_test_R_C_MISR1_CTRLSIG1_MASK      (0xFFU)
#define MSF1_B_test_R_C_MISR1_CTRLSIG1_SHIFT     (0U)
/*! CTRLSIG1 - MISR Control Signature High */
#define MSF1_B_test_R_C_MISR1_CTRLSIG1(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_C_MISR1_CTRLSIG1_SHIFT)) & MSF1_B_test_R_C_MISR1_CTRLSIG1_MASK)
/*! @} */

/*! @name R_DATA_CTRL1_EX - BIST Data Control 1 Extension Register */
/*! @{ */

#define MSF1_B_test_R_DATA_CTRL1_EX_DATA1X_MASK  (0x7U)
#define MSF1_B_test_R_DATA_CTRL1_EX_DATA1X_SHIFT (0U)
/*! DATA1X - BIST Data 1 High */
#define MSF1_B_test_R_DATA_CTRL1_EX_DATA1X(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DATA_CTRL1_EX_DATA1X_SHIFT)) & MSF1_B_test_R_DATA_CTRL1_EX_DATA1X_MASK)
/*! @} */

/*! @name R_DATA_CTRL2_EX - BIST Data Control 2 Extension Register */
/*! @{ */

#define MSF1_B_test_R_DATA_CTRL2_EX_DATA2X_MASK  (0x7U)
#define MSF1_B_test_R_DATA_CTRL2_EX_DATA2X_SHIFT (0U)
/*! DATA2X - BIST Data 2 High */
#define MSF1_B_test_R_DATA_CTRL2_EX_DATA2X(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DATA_CTRL2_EX_DATA2X_SHIFT)) & MSF1_B_test_R_DATA_CTRL2_EX_DATA2X_MASK)
/*! @} */

/*! @name R_DATA_CTRL3_EX - BIST Data Control 3 Extension Register */
/*! @{ */

#define MSF1_B_test_R_DATA_CTRL3_EX_DATA3X_MASK  (0x7U)
#define MSF1_B_test_R_DATA_CTRL3_EX_DATA3X_SHIFT (0U)
/*! DATA3X - BIST Data 3 High */
#define MSF1_B_test_R_DATA_CTRL3_EX_DATA3X(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_R_DATA_CTRL3_EX_DATA3X_SHIFT)) & MSF1_B_test_R_DATA_CTRL3_EX_DATA3X_MASK)
/*! @} */

/*! @name SMW_TIMER_OPTION - SMW Timer Option Register */
/*! @{ */

#define MSF1_B_test_SMW_TIMER_OPTION_SMW_CDIVL_MASK (0xFFU)
#define MSF1_B_test_SMW_TIMER_OPTION_SMW_CDIVL_SHIFT (0U)
/*! SMW_CDIVL - Clock Divide Scalar for Long Pulse */
#define MSF1_B_test_SMW_TIMER_OPTION_SMW_CDIVL(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_TIMER_OPTION_SMW_CDIVL_SHIFT)) & MSF1_B_test_SMW_TIMER_OPTION_SMW_CDIVL_MASK)

#define MSF1_B_test_SMW_TIMER_OPTION_SMW_TVFY_MASK (0x1F00U)
#define MSF1_B_test_SMW_TIMER_OPTION_SMW_TVFY_SHIFT (8U)
/*! SMW_TVFY - Timer Adjust for Verify */
#define MSF1_B_test_SMW_TIMER_OPTION_SMW_TVFY(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_TIMER_OPTION_SMW_TVFY_SHIFT)) & MSF1_B_test_SMW_TIMER_OPTION_SMW_TVFY_MASK)
/*! @} */

/*! @name SMW_SETTING_OPTION0 - SMW Setting Option 0 Register */
/*! @{ */

#define MSF1_B_test_SMW_SETTING_OPTION0_MV_INIT_MASK (0x1C000U)
#define MSF1_B_test_SMW_SETTING_OPTION0_MV_INIT_SHIFT (14U)
/*! MV_INIT - Medium Voltage Level Select Initial */
#define MSF1_B_test_SMW_SETTING_OPTION0_MV_INIT(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION0_MV_INIT_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION0_MV_INIT_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION0_MV_END_MASK (0xE0000U)
#define MSF1_B_test_SMW_SETTING_OPTION0_MV_END_SHIFT (17U)
/*! MV_END - Medium Voltage Level Select Final */
#define MSF1_B_test_SMW_SETTING_OPTION0_MV_END(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION0_MV_END_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION0_MV_END_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION0_MV_MISC_MASK (0xF00000U)
#define MSF1_B_test_SMW_SETTING_OPTION0_MV_MISC_SHIFT (20U)
/*! MV_MISC - Medium Voltage Control Misc */
#define MSF1_B_test_SMW_SETTING_OPTION0_MV_MISC(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION0_MV_MISC_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION0_MV_MISC_MASK)

