zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_SMW_SETTING_OPTION0_IPGM_INIT_MASK (0x3000000U)
#define MSF1_B_test_SMW_SETTING_OPTION0_IPGM_INIT_SHIFT (24U)
/*! IPGM_INIT - Program Current Control Initial */
#define MSF1_B_test_SMW_SETTING_OPTION0_IPGM_INIT(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION0_IPGM_INIT_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION0_IPGM_INIT_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION0_IPGM_END_MASK (0xC000000U)
#define MSF1_B_test_SMW_SETTING_OPTION0_IPGM_END_SHIFT (26U)
/*! IPGM_END - Program Current Control Final */
#define MSF1_B_test_SMW_SETTING_OPTION0_IPGM_END(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION0_IPGM_END_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION0_IPGM_END_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION0_IPGM_MISC_MASK (0x70000000U)
#define MSF1_B_test_SMW_SETTING_OPTION0_IPGM_MISC_SHIFT (28U)
/*! IPGM_MISC - Program Current Control Misc */
#define MSF1_B_test_SMW_SETTING_OPTION0_IPGM_MISC(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION0_IPGM_MISC_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION0_IPGM_MISC_MASK)
/*! @} */

/*! @name SMW_SETTING_OPTION2 - SMW Setting Option 2 Register */
/*! @{ */

#define MSF1_B_test_SMW_SETTING_OPTION2_THVS_CTRL_MASK (0x7U)
#define MSF1_B_test_SMW_SETTING_OPTION2_THVS_CTRL_SHIFT (0U)
/*! THVS_CTRL - Thvs control */
#define MSF1_B_test_SMW_SETTING_OPTION2_THVS_CTRL(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION2_THVS_CTRL_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION2_THVS_CTRL_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION2_TRCV_CTRL_MASK (0x38U)
#define MSF1_B_test_SMW_SETTING_OPTION2_TRCV_CTRL_SHIFT (3U)
/*! TRCV_CTRL - Trcv Control */
#define MSF1_B_test_SMW_SETTING_OPTION2_TRCV_CTRL(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION2_TRCV_CTRL_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION2_TRCV_CTRL_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION2_XTRA_ERS_MASK (0xC0U)
#define MSF1_B_test_SMW_SETTING_OPTION2_XTRA_ERS_SHIFT (6U)
/*! XTRA_ERS - Number of Post Shots for SME */
#define MSF1_B_test_SMW_SETTING_OPTION2_XTRA_ERS(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION2_XTRA_ERS_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION2_XTRA_ERS_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION2_XTRA_PGM_MASK (0x300U)
#define MSF1_B_test_SMW_SETTING_OPTION2_XTRA_PGM_SHIFT (8U)
/*! XTRA_PGM - Number of Post Shots for SMP */
#define MSF1_B_test_SMW_SETTING_OPTION2_XTRA_PGM(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION2_XTRA_PGM_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION2_XTRA_PGM_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION2_WHV_CNTR_MASK (0x3FC00U)
#define MSF1_B_test_SMW_SETTING_OPTION2_WHV_CNTR_SHIFT (10U)
/*! WHV_CNTR - WHV Counter */
#define MSF1_B_test_SMW_SETTING_OPTION2_WHV_CNTR(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION2_WHV_CNTR_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION2_WHV_CNTR_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION2_POST_TERS_MASK (0x1C0000U)
#define MSF1_B_test_SMW_SETTING_OPTION2_POST_TERS_SHIFT (18U)
/*! POST_TERS - Post Ters Time
 *  0b000..50 usec
 *  0b001..100 usec
 *  0b010..200 usec
 *  0b011..300 usec
 *  0b100..500 usec
 *  0b101..1 msec
 *  0b110..1.5 msec
 *  0b111..2 msec
 */
#define MSF1_B_test_SMW_SETTING_OPTION2_POST_TERS(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION2_POST_TERS_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION2_POST_TERS_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION2_POST_TPGM_MASK (0x600000U)
#define MSF1_B_test_SMW_SETTING_OPTION2_POST_TPGM_SHIFT (21U)
/*! POST_TPGM - Post Tpgm Time
 *  0b00..1 usec
 *  0b01..2 usec
 *  0b10..4 usec
 *  0b11..8 usec
 */
#define MSF1_B_test_SMW_SETTING_OPTION2_POST_TPGM(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION2_POST_TPGM_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION2_POST_TPGM_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION2_VFY_OPT_MASK (0x1800000U)
#define MSF1_B_test_SMW_SETTING_OPTION2_VFY_OPT_SHIFT (23U)
/*! VFY_OPT - Verify Option
 *  0b00..Skip verify for post shot only, verify for all other shots
 *  0b01..Skip verify for the 1st and post shots
 *  0b10..Skip the 1st, 2nd, and post shots
 *  0b11..Skip verify for all shots
 */
#define MSF1_B_test_SMW_SETTING_OPTION2_VFY_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION2_VFY_OPT_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION2_VFY_OPT_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION2_TPGM_OPT_MASK (0x6000000U)
#define MSF1_B_test_SMW_SETTING_OPTION2_TPGM_OPT_SHIFT (25U)
/*! TPGM_OPT - Tpgm Option
 *  0b00..Fixed Tpgm for all shots, except post shot
 *  0b01..Increase Tpgm option by 1 for each loop until Tpgm reaches 4 usec
 *  0b10..Increase Tpgm option by 1 for each loop until Tpgm reaches 8 usec
 *  0b11..Unused
 */
#define MSF1_B_test_SMW_SETTING_OPTION2_TPGM_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION2_TPGM_OPT_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION2_TPGM_OPT_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION2_MASK0_OPT_MASK (0x8000000U)
#define MSF1_B_test_SMW_SETTING_OPTION2_MASK0_OPT_SHIFT (27U)
/*! MASK0_OPT - MASK0_OPT
 *  0b0..Mask programmed bits passing PV until extra shot
 *  0b1..Always program bits even if they pass PV
 */
#define MSF1_B_test_SMW_SETTING_OPTION2_MASK0_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION2_MASK0_OPT_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION2_MASK0_OPT_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION2_DIS_PRER_MASK (0x10000000U)
#define MSF1_B_test_SMW_SETTING_OPTION2_DIS_PRER_SHIFT (28U)
/*! DIS_PRER - Disable pre-PV Read before First Program Shot
 *  0b0..Enable pre-PV read before first program shot
 *  0b1..Disable pre-PV read before first program shot
 */
#define MSF1_B_test_SMW_SETTING_OPTION2_DIS_PRER(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION2_DIS_PRER_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION2_DIS_PRER_MASK)
/*! @} */

/*! @name SMW_SETTING_OPTION3 - SMW Setting Option 3 Register */
/*! @{ */

#define MSF1_B_test_SMW_SETTING_OPTION3_HEM_WHV_CNTR_MASK (0xFFU)
#define MSF1_B_test_SMW_SETTING_OPTION3_HEM_WHV_CNTR_SHIFT (0U)
/*! HEM_WHV_CNTR - WHV_COUNTER for HEM-erase Cycle */
#define MSF1_B_test_SMW_SETTING_OPTION3_HEM_WHV_CNTR(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION3_HEM_WHV_CNTR_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION3_HEM_WHV_CNTR_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION3_HEM_MAX_ERS_MASK (0x1FF00U)
#define MSF1_B_test_SMW_SETTING_OPTION3_HEM_MAX_ERS_SHIFT (8U)
/*! HEM_MAX_ERS - HEM Max Erase Shot Count */
#define MSF1_B_test_SMW_SETTING_OPTION3_HEM_MAX_ERS(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION3_HEM_MAX_ERS_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION3_HEM_MAX_ERS_MASK)
/*! @} */

/*! @name SMW_SMP_WHV_OPTION0 - SMW SMP WHV Option 0 Register */
/*! @{ */

#define MSF1_B_test_SMW_SMP_WHV_OPTION0_SMP_WHV_OPT0_MASK (0xFFFFFFFFU)
#define MSF1_B_test_SMW_SMP_WHV_OPTION0_SMP_WHV_OPT0_SHIFT (0U)
/*! SMP_WHV_OPT0 - Smart Program WHV Option Low */
#define MSF1_B_test_SMW_SMP_WHV_OPTION0_SMP_WHV_OPT0(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SMP_WHV_OPTION0_SMP_WHV_OPT0_SHIFT)) & MSF1_B_test_SMW_SMP_WHV_OPTION0_SMP_WHV_OPT0_MASK)
/*! @} */

/*! @name SMW_SME_WHV_OPTION0 - SMW SME WHV Option 0 Register */
/*! @{ */

#define MSF1_B_test_SMW_SME_WHV_OPTION0_SME_WHV_OPT0_MASK (0xFFFFFFFFU)
#define MSF1_B_test_SMW_SME_WHV_OPTION0_SME_WHV_OPT0_SHIFT (0U)
/*! SME_WHV_OPT0 - Smart Erase WHV Option Low */
#define MSF1_B_test_SMW_SME_WHV_OPTION0_SME_WHV_OPT0(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SME_WHV_OPTION0_SME_WHV_OPT0_SHIFT)) & MSF1_B_test_SMW_SME_WHV_OPTION0_SME_WHV_OPT0_MASK)
/*! @} */

/*! @name SMW_SETTING_OPTION1 - SMW Setting Option 1 Register */
/*! @{ */

