zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_SMW_SETTING_OPTION1_TERS_CTRL0_MASK (0x7U)
#define MSF1_B_test_SMW_SETTING_OPTION1_TERS_CTRL0_SHIFT (0U)
/*! TERS_CTRL0 - Ters Control
 *  0b000..50 usec
 *  0b001..100 usec
 *  0b010..200 usec
 *  0b011..300 usec
 *  0b100..500 usec
 *  0b101..1 msec
 *  0b110..1.5 msec
 *  0b111..2 msec
 */
#define MSF1_B_test_SMW_SETTING_OPTION1_TERS_CTRL0(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION1_TERS_CTRL0_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION1_TERS_CTRL0_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION1_TPGM_CTRL_MASK (0x18U)
#define MSF1_B_test_SMW_SETTING_OPTION1_TPGM_CTRL_SHIFT (3U)
/*! TPGM_CTRL - Tpgm Control
 *  0b00..1 usec
 *  0b01..2 usec
 *  0b10..4 usec
 *  0b11..8 usec
 */
#define MSF1_B_test_SMW_SETTING_OPTION1_TPGM_CTRL(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION1_TPGM_CTRL_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION1_TPGM_CTRL_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION1_TNVS_CTRL_MASK (0xE0U)
#define MSF1_B_test_SMW_SETTING_OPTION1_TNVS_CTRL_SHIFT (5U)
/*! TNVS_CTRL - Tnvs Control
 *  0b000..5 usec
 *  0b001..8 usec
 *  0b010..11 usec
 *  0b011..14 usec
 *  0b100..17 usec
 *  0b101..20 usec
 *  0b110..23 usec
 *  0b111..26 usec
 */
#define MSF1_B_test_SMW_SETTING_OPTION1_TNVS_CTRL(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION1_TNVS_CTRL_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION1_TNVS_CTRL_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION1_TNVH_CTRL_MASK (0x700U)
#define MSF1_B_test_SMW_SETTING_OPTION1_TNVH_CTRL_SHIFT (8U)
/*! TNVH_CTRL - Tnvh Control
 *  0b000..2 usec
 *  0b001..2.5 usec
 *  0b010..3 usec
 *  0b011..3.5 usec
 *  0b100..4 usec
 *  0b101..4.5 usec
 *  0b110..5 usec
 *  0b111..5.5 usec
 */
#define MSF1_B_test_SMW_SETTING_OPTION1_TNVH_CTRL(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION1_TNVH_CTRL_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION1_TNVH_CTRL_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION1_TPGS_CTRL_MASK (0x3800U)
#define MSF1_B_test_SMW_SETTING_OPTION1_TPGS_CTRL_SHIFT (11U)
/*! TPGS_CTRL - Tpgs Control
 *  0b000..1 usec
 *  0b001..2 usec
 *  0b010..3 usec
 *  0b011..4 usec
 *  0b100..5 usec
 *  0b101..6 usec
 *  0b110..7 usec
 *  0b111..8 usec
 */
#define MSF1_B_test_SMW_SETTING_OPTION1_TPGS_CTRL(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION1_TPGS_CTRL_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION1_TPGS_CTRL_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION1_MAX_ERASE_MASK (0x7FC000U)
#define MSF1_B_test_SMW_SETTING_OPTION1_MAX_ERASE_SHIFT (14U)
/*! MAX_ERASE - Number of Erase Shots */
#define MSF1_B_test_SMW_SETTING_OPTION1_MAX_ERASE(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION1_MAX_ERASE_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION1_MAX_ERASE_MASK)

#define MSF1_B_test_SMW_SETTING_OPTION1_MAX_PROG_MASK (0xF800000U)
#define MSF1_B_test_SMW_SETTING_OPTION1_MAX_PROG_SHIFT (23U)
/*! MAX_PROG - Number of Program Shots */
#define MSF1_B_test_SMW_SETTING_OPTION1_MAX_PROG(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SETTING_OPTION1_MAX_PROG_SHIFT)) & MSF1_B_test_SMW_SETTING_OPTION1_MAX_PROG_MASK)
/*! @} */

/*! @name SMW_SMP_WHV_OPTION1 - SMW SMP WHV Option 1 Register */
/*! @{ */

#define MSF1_B_test_SMW_SMP_WHV_OPTION1_SMP_WHV_OPT1_MASK (0xFFFFFFFFU)
#define MSF1_B_test_SMW_SMP_WHV_OPTION1_SMP_WHV_OPT1_SHIFT (0U)
/*! SMP_WHV_OPT1 - Smart Program WHV Option High */
#define MSF1_B_test_SMW_SMP_WHV_OPTION1_SMP_WHV_OPT1(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SMP_WHV_OPTION1_SMP_WHV_OPT1_SHIFT)) & MSF1_B_test_SMW_SMP_WHV_OPTION1_SMP_WHV_OPT1_MASK)
/*! @} */

/*! @name SMW_SME_WHV_OPTION1 - SMW SME WHV Option 1 Register */
/*! @{ */

#define MSF1_B_test_SMW_SME_WHV_OPTION1_SME_WHV_OPT1_MASK (0xFFFFFFFFU)
#define MSF1_B_test_SMW_SME_WHV_OPTION1_SME_WHV_OPT1_SHIFT (0U)
/*! SME_WHV_OPT1 - Smart Erase WHV Option High */
#define MSF1_B_test_SMW_SME_WHV_OPTION1_SME_WHV_OPT1(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_SME_WHV_OPTION1_SME_WHV_OPT1_SHIFT)) & MSF1_B_test_SMW_SME_WHV_OPTION1_SME_WHV_OPT1_MASK)
/*! @} */

/*! @name REPAIR0_0 - FMU Repair 0 Block 0 Register */
/*! @{ */

#define MSF1_B_test_REPAIR0_0_RDIS0_0_MASK       (0x1U)
#define MSF1_B_test_REPAIR0_0_RDIS0_0_SHIFT      (0U)
/*! RDIS0_0 - RDIS0_0
 *  0b0..Repair address is valid
 *  0b1..Repair address is not valid
 */
#define MSF1_B_test_REPAIR0_0_RDIS0_0(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_REPAIR0_0_RDIS0_0_SHIFT)) & MSF1_B_test_REPAIR0_0_RDIS0_0_MASK)

#define MSF1_B_test_REPAIR0_0_RADR0_0_MASK       (0x1FEU)
#define MSF1_B_test_REPAIR0_0_RADR0_0_SHIFT      (1U)
/*! RADR0_0 - RADR0_0 */
#define MSF1_B_test_REPAIR0_0_RADR0_0(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_REPAIR0_0_RADR0_0_SHIFT)) & MSF1_B_test_REPAIR0_0_RADR0_0_MASK)
/*! @} */

/*! @name REPAIR0_1 - FMU Repair 1 Block 0 Register */
/*! @{ */

#define MSF1_B_test_REPAIR0_1_RDIS0_1_MASK       (0x1U)
#define MSF1_B_test_REPAIR0_1_RDIS0_1_SHIFT      (0U)
/*! RDIS0_1 - RDIS0_1
 *  0b0..Repair address is valid
 *  0b1..Repair address is not valid
 */
#define MSF1_B_test_REPAIR0_1_RDIS0_1(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_REPAIR0_1_RDIS0_1_SHIFT)) & MSF1_B_test_REPAIR0_1_RDIS0_1_MASK)

#define MSF1_B_test_REPAIR0_1_RADR0_1_MASK       (0x1FEU)
#define MSF1_B_test_REPAIR0_1_RADR0_1_SHIFT      (1U)
/*! RADR0_1 - RADR0_1 */
#define MSF1_B_test_REPAIR0_1_RADR0_1(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_REPAIR0_1_RADR0_1_SHIFT)) & MSF1_B_test_REPAIR0_1_RADR0_1_MASK)
/*! @} */

/*! @name REPAIR1_0 - FMU Repair 0 Block 1 Register */
/*! @{ */

#define MSF1_B_test_REPAIR1_0_RDIS1_0_MASK       (0x1U)
#define MSF1_B_test_REPAIR1_0_RDIS1_0_SHIFT      (0U)
/*! RDIS1_0 - RDIS1_0
 *  0b0..Repair address is valid
 *  0b1..Repair address is not valid
 */
#define MSF1_B_test_REPAIR1_0_RDIS1_0(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_REPAIR1_0_RDIS1_0_SHIFT)) & MSF1_B_test_REPAIR1_0_RDIS1_0_MASK)

#define MSF1_B_test_REPAIR1_0_RADR1_0_MASK       (0x1FEU)
#define MSF1_B_test_REPAIR1_0_RADR1_0_SHIFT      (1U)
/*! RADR1_0 - RADR1_0 */
#define MSF1_B_test_REPAIR1_0_RADR1_0(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_REPAIR1_0_RADR1_0_SHIFT)) & MSF1_B_test_REPAIR1_0_RADR1_0_MASK)
/*! @} */

/*! @name REPAIR1_1 - FMU Repair 1 Block 1 Register */
/*! @{ */

