zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_REPAIR1_1_RDIS1_1_MASK       (0x1U)
#define MSF1_B_test_REPAIR1_1_RDIS1_1_SHIFT      (0U)
/*! RDIS1_1 - RDIS1_1
 *  0b0..Repair address is valid
 *  0b1..Repair address is not valid
 */
#define MSF1_B_test_REPAIR1_1_RDIS1_1(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_REPAIR1_1_RDIS1_1_SHIFT)) & MSF1_B_test_REPAIR1_1_RDIS1_1_MASK)

#define MSF1_B_test_REPAIR1_1_RADR1_1_MASK       (0x1FEU)
#define MSF1_B_test_REPAIR1_1_RADR1_1_SHIFT      (1U)
/*! RADR1_1 - RADR1_1 */
#define MSF1_B_test_REPAIR1_1_RADR1_1(x)         (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_REPAIR1_1_RADR1_1_SHIFT)) & MSF1_B_test_REPAIR1_1_RADR1_1_MASK)
/*! @} */

/*! @name SMW_HB_SIGNALS - SMW HB Signals Register */
/*! @{ */

#define MSF1_B_test_SMW_HB_SIGNALS_SMW_ARRAY_MASK (0x7U)
#define MSF1_B_test_SMW_HB_SIGNALS_SMW_ARRAY_SHIFT (0U)
/*! SMW_ARRAY - SMW Region Select
 *  0b000..Main array
 *  0b001..IFR space only or main (and REDEN space) with IFR space for mass erase
 *  0b010..IFR1 space
 *  0b100..REDEN space
 */
#define MSF1_B_test_SMW_HB_SIGNALS_SMW_ARRAY(x)  (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_HB_SIGNALS_SMW_ARRAY_SHIFT)) & MSF1_B_test_SMW_HB_SIGNALS_SMW_ARRAY_MASK)

#define MSF1_B_test_SMW_HB_SIGNALS_USER_IFREN1_MASK (0x8U)
#define MSF1_B_test_SMW_HB_SIGNALS_USER_IFREN1_SHIFT (3U)
/*! USER_IFREN1 - IFR1 Enable
 *  0b0..IFREN1 input to the flash array is driven LOW
 *  0b1..IFREN1 input to the flash array is driven HIGH
 */
#define MSF1_B_test_SMW_HB_SIGNALS_USER_IFREN1(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_HB_SIGNALS_USER_IFREN1_SHIFT)) & MSF1_B_test_SMW_HB_SIGNALS_USER_IFREN1_MASK)

#define MSF1_B_test_SMW_HB_SIGNALS_USER_PV_MASK  (0x10U)
#define MSF1_B_test_SMW_HB_SIGNALS_USER_PV_SHIFT (4U)
/*! USER_PV - Program Verify
 *  0b0..PV input to the flash array is driven LOW
 *  0b1..PV input to the flash array is driven HIGH
 */
#define MSF1_B_test_SMW_HB_SIGNALS_USER_PV(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_HB_SIGNALS_USER_PV_SHIFT)) & MSF1_B_test_SMW_HB_SIGNALS_USER_PV_MASK)

#define MSF1_B_test_SMW_HB_SIGNALS_USER_EV_MASK  (0x20U)
#define MSF1_B_test_SMW_HB_SIGNALS_USER_EV_SHIFT (5U)
/*! USER_EV - Erase Verify
 *  0b0..EV input to the flash array is driven LOW
 *  0b1..EV input to the flash array is driven HIGH
 */
#define MSF1_B_test_SMW_HB_SIGNALS_USER_EV(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_HB_SIGNALS_USER_EV_SHIFT)) & MSF1_B_test_SMW_HB_SIGNALS_USER_EV_MASK)

#define MSF1_B_test_SMW_HB_SIGNALS_USER_IFREN_MASK (0x40U)
#define MSF1_B_test_SMW_HB_SIGNALS_USER_IFREN_SHIFT (6U)
/*! USER_IFREN - IFR Enable
 *  0b0..IFREN input to the flash array is driven LOW
 *  0b1..IFREN input to the flash array is driven HIGH
 */
#define MSF1_B_test_SMW_HB_SIGNALS_USER_IFREN(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_HB_SIGNALS_USER_IFREN_SHIFT)) & MSF1_B_test_SMW_HB_SIGNALS_USER_IFREN_MASK)

#define MSF1_B_test_SMW_HB_SIGNALS_USER_REDEN_MASK (0x80U)
#define MSF1_B_test_SMW_HB_SIGNALS_USER_REDEN_SHIFT (7U)
/*! USER_REDEN - Repair Read Enable
 *  0b0..REDEN input to the flash array is driven LOW
 *  0b1..REDEN input to the flash array is driven HIGH
 */
#define MSF1_B_test_SMW_HB_SIGNALS_USER_REDEN(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_HB_SIGNALS_USER_REDEN_SHIFT)) & MSF1_B_test_SMW_HB_SIGNALS_USER_REDEN_MASK)

#define MSF1_B_test_SMW_HB_SIGNALS_USER_HEM_MASK (0x100U)
#define MSF1_B_test_SMW_HB_SIGNALS_USER_HEM_SHIFT (8U)
/*! USER_HEM - High Endurance Enable
 *  0b0..HEM input to SMW / BIST PIN_CTRL[24] is driven LOW
 *  0b1..HEM input to SMW / BIST PIN_CTRL[24] is driven HIGH
 */
#define MSF1_B_test_SMW_HB_SIGNALS_USER_HEM(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_SMW_HB_SIGNALS_USER_HEM_SHIFT)) & MSF1_B_test_SMW_HB_SIGNALS_USER_HEM_MASK)
/*! @} */

/*! @name BIST_DUMP_CTRL - BIST Datadump Control Register */
/*! @{ */

#define MSF1_B_test_BIST_DUMP_CTRL_BIST_DONE_MASK (0x10000U)
#define MSF1_B_test_BIST_DUMP_CTRL_BIST_DONE_SHIFT (16U)
/*! BIST_DONE - BIST Done
 *  0b0..The BIST (or data dump) is running
 *  0b1..The BIST (or data dump) has completed
 */
#define MSF1_B_test_BIST_DUMP_CTRL_BIST_DONE(x)  (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_BIST_DUMP_CTRL_BIST_DONE_SHIFT)) & MSF1_B_test_BIST_DUMP_CTRL_BIST_DONE_MASK)

#define MSF1_B_test_BIST_DUMP_CTRL_BIST_FAIL_MASK (0x20000U)
#define MSF1_B_test_BIST_DUMP_CTRL_BIST_FAIL_SHIFT (17U)
/*! BIST_FAIL - BIST Fail
 *  0b0..The last BIST operation completed successfully (or could not fail)
 *  0b1..The last BIST operation failed
 */
#define MSF1_B_test_BIST_DUMP_CTRL_BIST_FAIL(x)  (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_BIST_DUMP_CTRL_BIST_FAIL_SHIFT)) & MSF1_B_test_BIST_DUMP_CTRL_BIST_FAIL_MASK)

#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MASK (0x40000U)
#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_SHIFT (18U)
/*! DATADUMP - Data Dump Enable */
#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_SHIFT)) & MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MASK)

#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_TRIG_MASK (0x80000U)
#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_TRIG_SHIFT (19U)
/*! DATADUMP_TRIG - Data Dump Trigger */
#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_TRIG(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_TRIG_SHIFT)) & MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_TRIG_MASK)

#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_PATT_MASK (0x300000U)
#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_PATT_SHIFT (20U)
/*! DATADUMP_PATT - Data Dump Pattern Select
 *  0b00..All ones
 *  0b01..All zeroes
 *  0b10..Checkerboard
 *  0b11..Inverse checkerboard
 */
#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_PATT(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_PATT_SHIFT)) & MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_PATT_MASK)

#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MRGEN_MASK (0x400000U)
#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MRGEN_SHIFT (22U)
/*! DATADUMP_MRGEN - Data Dump Margin Enable
 *  0b0..Normal read pulse shape
 *  0b1..Margin read pulse shape
 */
#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MRGEN(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MRGEN_SHIFT)) & MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MRGEN_MASK)

#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MRGTYPE_MASK (0x800000U)
#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MRGTYPE_SHIFT (23U)
/*! DATADUMP_MRGTYPE - Data Dump Margin Type
 *  0b0..DIN method used
 *  0b1..TM method used
 */
#define MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MRGTYPE(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MRGTYPE_SHIFT)) & MSF1_B_test_BIST_DUMP_CTRL_DATADUMP_MRGTYPE_MASK)
/*! @} */

/*! @name ATX_PIN_CTRL - ATX Pin Control Register */
/*! @{ */

