zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph3/PERI_MSF1_B_TEST.h
#define MSF1_B_test_ATX_PIN_CTRL_TM_TO_ATX_MASK  (0xFFU)
#define MSF1_B_test_ATX_PIN_CTRL_TM_TO_ATX_SHIFT (0U)
/*! TM_TO_ATX - TM to ATX
 *  0b00000001..TM[0] to ATX0
 *  0b00000010..TM[1] to ATX0
 *  0b00000100..TM[2] to ATX0
 *  0b00001000..TM[3] to ATX0
 *  0b00010000..TM[0] to ATX1
 *  0b00100000..TM[1] to ATX1
 *  0b01000000..TM[2] to ATX1
 *  0b10000000..TM[3] to ATX1
 */
#define MSF1_B_test_ATX_PIN_CTRL_TM_TO_ATX(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_ATX_PIN_CTRL_TM_TO_ATX_SHIFT)) & MSF1_B_test_ATX_PIN_CTRL_TM_TO_ATX_MASK)
/*! @} */

/*! @name FAILCNT - Fail Count Register */
/*! @{ */

#define MSF1_B_test_FAILCNT_FAILCNT_MASK         (0xFFFFFFFFU)
#define MSF1_B_test_FAILCNT_FAILCNT_SHIFT        (0U)
/*! FAILCNT - Fail Count */
#define MSF1_B_test_FAILCNT_FAILCNT(x)           (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_FAILCNT_FAILCNT_SHIFT)) & MSF1_B_test_FAILCNT_FAILCNT_MASK)
/*! @} */

/*! @name PGM_PULSE_CNT0 - Block 0 Program Pulse Count Register */
/*! @{ */

#define MSF1_B_test_PGM_PULSE_CNT0_PGM_CNT0_MASK (0xFFFFFFFFU)
#define MSF1_B_test_PGM_PULSE_CNT0_PGM_CNT0_SHIFT (0U)
/*! PGM_CNT0 - Program Pulse Count */
#define MSF1_B_test_PGM_PULSE_CNT0_PGM_CNT0(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_PGM_PULSE_CNT0_PGM_CNT0_SHIFT)) & MSF1_B_test_PGM_PULSE_CNT0_PGM_CNT0_MASK)
/*! @} */

/*! @name PGM_PULSE_CNT1 - Block 1 Program Pulse Count Register */
/*! @{ */

#define MSF1_B_test_PGM_PULSE_CNT1_PGM_CNT1_MASK (0xFFFFFFFFU)
#define MSF1_B_test_PGM_PULSE_CNT1_PGM_CNT1_SHIFT (0U)
/*! PGM_CNT1 - Program Pulse Count */
#define MSF1_B_test_PGM_PULSE_CNT1_PGM_CNT1(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_PGM_PULSE_CNT1_PGM_CNT1_SHIFT)) & MSF1_B_test_PGM_PULSE_CNT1_PGM_CNT1_MASK)
/*! @} */

/*! @name ERS_PULSE_CNT - Erase Pulse Count Register */
/*! @{ */

#define MSF1_B_test_ERS_PULSE_CNT_ERS_CNT0_MASK  (0xFFFFU)
#define MSF1_B_test_ERS_PULSE_CNT_ERS_CNT0_SHIFT (0U)
/*! ERS_CNT0 - Block 0 Erase Pulse Count */
#define MSF1_B_test_ERS_PULSE_CNT_ERS_CNT0(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_ERS_PULSE_CNT_ERS_CNT0_SHIFT)) & MSF1_B_test_ERS_PULSE_CNT_ERS_CNT0_MASK)

#define MSF1_B_test_ERS_PULSE_CNT_ERS_CNT1_MASK  (0xFFFF0000U)
#define MSF1_B_test_ERS_PULSE_CNT_ERS_CNT1_SHIFT (16U)
/*! ERS_CNT1 - Block 1 Erase Pulse Count */
#define MSF1_B_test_ERS_PULSE_CNT_ERS_CNT1(x)    (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_ERS_PULSE_CNT_ERS_CNT1_SHIFT)) & MSF1_B_test_ERS_PULSE_CNT_ERS_CNT1_MASK)
/*! @} */

/*! @name MAX_PULSE_CNT - Maximum Pulse Count Register */
/*! @{ */

#define MSF1_B_test_MAX_PULSE_CNT_LAST_PCNT_MASK (0x1FFU)
#define MSF1_B_test_MAX_PULSE_CNT_LAST_PCNT_SHIFT (0U)
/*! LAST_PCNT - Last SMW Operation's Pulse Count */
#define MSF1_B_test_MAX_PULSE_CNT_LAST_PCNT(x)   (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MAX_PULSE_CNT_LAST_PCNT_SHIFT)) & MSF1_B_test_MAX_PULSE_CNT_LAST_PCNT_MASK)

#define MSF1_B_test_MAX_PULSE_CNT_MAX_ERS_CNT_MASK (0x1FF0000U)
#define MSF1_B_test_MAX_PULSE_CNT_MAX_ERS_CNT_SHIFT (16U)
/*! MAX_ERS_CNT - Maximum Erase Pulse Count */
#define MSF1_B_test_MAX_PULSE_CNT_MAX_ERS_CNT(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MAX_PULSE_CNT_MAX_ERS_CNT_SHIFT)) & MSF1_B_test_MAX_PULSE_CNT_MAX_ERS_CNT_MASK)

#define MSF1_B_test_MAX_PULSE_CNT_MAX_PGM_CNT_MASK (0xF8000000U)
#define MSF1_B_test_MAX_PULSE_CNT_MAX_PGM_CNT_SHIFT (27U)
/*! MAX_PGM_CNT - Maximum Program Pulse Count */
#define MSF1_B_test_MAX_PULSE_CNT_MAX_PGM_CNT(x) (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_MAX_PULSE_CNT_MAX_PGM_CNT_SHIFT)) & MSF1_B_test_MAX_PULSE_CNT_MAX_PGM_CNT_MASK)
/*! @} */

/*! @name PORT_CTRL - Port Control Register */
/*! @{ */

#define MSF1_B_test_PORT_CTRL_BDONE_SEL_MASK     (0x3U)
#define MSF1_B_test_PORT_CTRL_BDONE_SEL_SHIFT    (0U)
/*! BDONE_SEL - BIST Done Select
 *  0b00..Select internal bist_done signal from current module instantiation
 *  0b01..Select ipt_bist_fail signal from current module instantiation
 *  0b10..Select ipt_bist_done signal from other module instantiation
 *  0b11..Select AND of internal bist_done signal from current module instantiation with ipt_bist_done signal from other module instantiation
 */
#define MSF1_B_test_PORT_CTRL_BDONE_SEL(x)       (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_PORT_CTRL_BDONE_SEL_SHIFT)) & MSF1_B_test_PORT_CTRL_BDONE_SEL_MASK)

#define MSF1_B_test_PORT_CTRL_BSDO_SEL_MASK      (0xCU)
#define MSF1_B_test_PORT_CTRL_BSDO_SEL_SHIFT     (2U)
/*! BSDO_SEL - BIST Serial Data Output Select
 *  0b00..Select internal bist_sdo signal from current module instantiation
 *  0b01..Select ipt_bist_done signal from current module instantiation
 *  0b10..Select ipt_bist_sdo signal from other module instantiation
 *  0b11..Select ipt_bist_done signal from other module instantiation
 */
#define MSF1_B_test_PORT_CTRL_BSDO_SEL(x)        (((uint32_t)(((uint32_t)(x)) << MSF1_B_test_PORT_CTRL_BSDO_SEL_SHIFT)) & MSF1_B_test_PORT_CTRL_BSDO_SEL_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group MSF1_B_test_Register_Masks */


/*!
 * @}
 */ /* end of group MSF1_B_test_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_MSF1_B_TEST_H_ */

